{
  "definicao": "O Analista de Dados (Data Analyst) formado por esta trilha será um profissional completo, apto a extrair, manipular, analisar e comunicar informações relevantes a partir de grandes volumes de dados estruturados e não estruturados. Será capaz de utilizar ferramentas modernas de análise, bancos de dados relacionais e não relacionais, linguagens de programação, técnicas de visualização e storytelling, além de compreender o contexto de negócio para gerar insights estratégicos. Desenvolverá tanto hard skills técnicas quanto soft skills essenciais para atuar de forma colaborativa, crítica e inovadora em equipes multidisciplinares, adaptando-se a diferentes desafios do mercado de trabalho orientado a dados.",
  "ementa": [
    {
      "nivel": "Nivelamento",
      "subnivel": "Nível I",
      "objetivos_gerais": [
        "Entender conceitos fundamentais sobre dados e análise",
        "Familiarizar-se com as principais ferramentas e linguagens de programação utilizadas na área.",
        "Desenvolver habilidades básicas em manipulação e análise de dados.",
        "Compreender conceitos fundamentais de matemática, estatística básica e lógica necessários para análise de dados."
      ],
      "blocos_tematicos": [
        {
          "nome": "Introdução à Programação",
          "descricao": "Apresenta os fundamentos da programação com foco na linguagem Python, cobrindo lógica de programação, estruturas de controle, variáveis, funções e estruturas de dados básicas. O objetivo é desenvolver o raciocínio computacional e preparar o aluno para manipular dados programaticamente, um passo essencial para análises mais robustas.",
          "projetos": [
            "Análise Básica de Dados com Python"
          ],
          "hard_skills": [
            "Fundamentos de programação com Python (variáveis, loops, condicionais)",
            "Manipulação básica de dados com listas e dicionários",
            "Leitura e escrita de arquivos simples (ex: CSV)"
          ],
          "soft_skills": [
            "Resolução de problemas com abordagem lógica",
            "Pensamento crítico aplicado a dados e algoritmos",
            "Autonomia para buscar soluções usando documentação e IA"
          ],
          "ferramentas_principais": [
            "Python",
            "VS Code",
            "Google Colab",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos": [
                {
                  "id": 2922,
                  "nome": "Python para Data Science: primeiros passos",
                  "link": "https://cursos.alura.com.br/course/python-data-science-primeiros-passos",
                  "status": "CARREIRA"
                },
                {
                  "id": 2923,
                  "nome": "Python para Data Science: trabalhando com funções, estruturas de dados e exceções",
                  "link": "https://cursos.alura.com.br/course/python-data-science-funcoes-estruturas-dados-excecoes",
                  "status": "CARREIRA"
                },
                {
                  "id": 4415,
                  "nome": "Praticando Python: estruturas de dados",
                  "link": "https://cursos.alura.com.br/course/praticando-python-estruturas-dados",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "SQL Básico para Análise de Dados",
          "descricao": "Introduz os fundamentos do SQL, destacando sua importância na análise de dados e seu uso em bancos relacionais. Aborda os principais comandos para consulta, filtragem e ordenação de dados, além da criação de estruturas simples em bancos como SQLite. O objetivo é capacitar o aluno a interagir com bases relacionais para extrair informações relevantes de forma estruturada.",
          "projetos": [
            "Extração de Informações com SQL em Banco SQLite",
            "Criação de Banco de Dados Relacional Simples"
          ],
          "hard_skills": [
            "Sintaxe básica de SQL (SELECT, WHERE, ORDER BY, LIMIT)",
            "Criação e manipulação de tabelas em bancos relacionais",
            "Leitura e interpretação de esquemas de banco de dados"
          ],
          "soft_skills": [
            "Pensamento lógico aplicado a estrutura de dados relacionais",
            "Resolução de problemas com consultas orientadas a objetivos",
            "Autonomia para testar hipóteses por meio de SQL"
          ],
          "ferramentas_principais": [
            "SQLite",
            "SQL Online",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "SQLite",
              "cursos": [
                {
                  "id": 2953,
                  "nome": "SQLite online: conhecendo instruções SQL",
                  "link": "https://cursos.alura.com.br/course/sqlite-online-conhecendo-instrucoes-sql",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Fundamentos Matemáticos e Estatísticos Básicos",
          "descricao": "Revisa os conceitos essenciais de matemática aplicada à análise de dados, como porcentagens, médias, medianas e distribuições. Introduz fundamentos de estatística descritiva, medidas de dispersão e noções iniciais de probabilidade. O objetivo é garantir uma base sólida para a interpretação de dados e compreensão de gráficos e resumos numéricos, usando planilhas ou linguagens como Python e R.",
          "projetos": [
            "Análise Descritiva Simples em Planilha."
          ],
          "hard_skills": [
            "Cálculo de média, mediana, moda, variância e desvio padrão",
            "Leitura e interpretação de gráficos estatísticos simples",
            "Noções básicas de probabilidade e distribuição de dados",
            "Uso de Excel, Python ou R para análise estatística descritiva"
          ],
          "soft_skills": [
            "Pensamento analítico para interpretação de dados",
            "Raciocínio lógico aplicado a relações numéricas",
            "Precisão na leitura e comunicação de resultados quantitativos"
          ],
          "ferramentas_principais": [
            "Excel",
            "Google Sheets",
            "Python",
            "R",
            "Google Colab"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos": [
                {
                  "id": 1177,
                  "nome": "Estatística com Python: frequências e medidas",
                  "link": "https://cursos.alura.com.br/course/estatistica-distribuicoes-e-medidas",
                  "status": "REGRAVAÇÃO"
                }
              ]
            }
          ]
        },
        {
          "nome": "Introdução à Computação em Nuvem para Análise de Dados",
          "descricao": "Apresenta os fundamentos da computação em nuvem com foco na análise de dados. Aborda conceitos essenciais como IaaS, PaaS, SaaS, regiões e zonas de disponibilidade, além de explorar os principais serviços oferecidos pelas plataformas AWS, Azure e Google Cloud. O objetivo é preparar o analista para compreender como os dados são armazenados, acessados e processados em ambientes cloud, com foco na coleta e uso inicial de dados em projetos analíticos.",
          "projetos": [
            "Exploração das principais plataformas de nuvem",
            "Coleta de dados a partir de um serviço cloud"
          ],
          "hard_skills": [
            "Compreensão dos modelos de serviço em nuvem (IaaS, PaaS, SaaS)",
            "Familiaridade com navegação e uso básico de plataformas cloud",
            "Coleta de dados de serviços e fontes hospedadas em nuvem"
          ],
          "soft_skills": [
            "Curiosidade técnica sobre infraestrutura e serviços de dados",
            "Iniciativa para explorar tecnologias modernas e documentações oficiais",
            "Capacidade de buscar soluções e identificar recursos em plataformas complexas"
          ],
          "ferramentas_principais": [
            "AWS",
            "Azure",
            "Google Cloud"
          ],
          "cursos": [
            {
              "stack": "Computação em Nuvem",
              "cursos": [
                {
                  "id": 0,
                  "nome": "Computação em Nuvem: Conhecendo os fundamentos básicos",
                  "link": "https://cursos.alura.com.br/",
                  "status": "NOVIDADE"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "nivel": "Iniciante",
      "subnivel": "Nível I",
      "objetivos_gerais": [
        "Aprender a manipular dados em planilhas e bancos de dados relacionais.",
        "Entender conceitos básicos de SQL e visualização de dados.",
        "Desenvolver habilidades iniciais de comunicação de resultados."
      ],
      "blocos_tematicos": [
        {
          "nome": "Primeiros Passos na Carreira de Analista de Dados",
          "descricao": "Apresenta os fundamentos iniciais da análise de dados, incluindo tipos de dados, estruturas básicas e principais etapas do processo analítico. Desenvolve a capacidade de interpretar tabelas, gráficos e resumos estatísticos, estimulando o pensamento analítico e crítico. O objetivo é tornar o aluno capaz de explorar, organizar e extrair conclusões fundamentadas a partir de dados reais, incentivando a curiosidade e o uso das principais ferramentas do mercado.",
          "projetos": [
            "Exploração de Bases de Dados Públicas",
            "Análise Exploratória Básica com Excel",
            "Leitura e interpretação de tabelas e gráficos",
            "Análise exploratória com geração de hipóteses"
          ],
          "hard_skills": [
            "Identificação de tipos de dados e estrutura básica de tabelas",
            "Leitura e interpretação de gráficos e tabelas estatísticas",
            "Aplicação de operações simples de análise com Excel",
            "Identificação de padrões e tendências em dados reais",
            "Formulação de hipóteses com base em dados quantitativos"
          ],
          "soft_skills": [
            "Curiosidade para explorar dados de diferentes origens",
            "Aprendizado contínuo e interesse por novas ferramentas",
            "Pensamento analítico orientado à resolução de problemas",
            "Pensamento crítico aplicado à validação de hipóteses"
          ],
          "ferramentas_principais": [
            "Excel",
            "GitHub", 
            "Google Drive", 
            "Notion",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Análise de Dados",
              "cursos": [
                {
                  "id": 0,
                  "nome": "Trabalhando com Dados: O que faz um profissional da área de dados",
                  "link": "https://cursos.alura.com.br/",
                  "status": "NOVIDADE"
                },
                {
                  "id": 0,
                  "nome": "Trabalhando com Dados: Pensamento Analítico em Dados Reais",
                  "link": "https://cursos.alura.com.br/",
                  "status": "NOVIDADE"
                },
                {
                  "id": 0,
                  "nome": "Metodologias Ágeis: Trabalhando com Metodologias Ágeis em Projetos de Dados",
                  "link": "https://cursos.alura.com.br/",
                  "status": "NOVIDADE"
                },
                {
                  "id": 0,
                  "nome": "Portfólio em Dados: Primeiros Passos e Documentação de Projetos",
                  "link": "https://cursos.alura.com.br/",
                  "status": "NOVIDADE"
                }
              ]
            }
          ]
        },
        {
          "nome": "Manipulação de Dados em Planilhas",
          "descricao": "Ensina o uso de planilhas como Excel e Google Sheets para organizar, tratar e analisar dados de forma prática. O conteúdo aborda fórmulas e funções comuns como PROCV/PROCX, SOMASE, SE, entre outras. Também inclui técnicas de limpeza de dados, como remoção de duplicatas e preenchimento de valores ausentes, além da criação de gráficos e dashboards simples diretamente na planilha.",
          "projetos": [
            "Análise de vendas com filtros e tabelas dinâmicas",
            "Limpeza de uma base de dados de clientes em planilha",
            "Dashboard simples de indicadores em excel ou sheets"
          ],
          "hard_skills": [
            "Uso avançado de fórmulas e funções em planilhas (PROCV/PROCX, SOMASE, SE)",
            "Limpeza e organização de dados em Excel ou Google Sheets",
            "Criação de gráficos e dashboards simples em planilhas"
          ],
          "soft_skills": [
            "Resolução prática de problemas com ferramentas acessíveis",
            "Curiosidade para explorar recursos avançados de planilhas",
            "Precisão e atenção aos detalhes na manipulação de dados"
          ],
          "ferramentas_principais": [
            "Excel",
            "Google Sheets",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Microsoft Excel",
              "cursos": [
                {
                  "id": 3195,
                  "nome": "Excel: domine o editor de planilhas",
                  "link": "https://cursos.alura.com.br/course/excel-domine-editor-planilhas",
                  "status": "CARREIRA"
                },
                {
                  "id": 3196,
                  "nome": "Funções com Excel: operações matemáticas e filtros",
                  "link": "https://cursos.alura.com.br/course/funcoes-excel-operacoes-matematicas-filtros",
                  "status": "CARREIRA"
                },
                {
                  "id": 3197,
                  "nome": "Recursos Visuais com Excel: explorando gráficos e formatos",
                  "link": "https://cursos.alura.com.br/course/recursos-visuais-excel-graficos-formatos",
                  "status": "CARREIRA"
                },
                {
                  "id": 3198,
                  "nome": "Excel: aprendendo lógica booleana e busca por valores",
                  "link": "https://cursos.alura.com.br/course/excel-logica-booleana-busca-valores",
                  "status": "CARREIRA"
                },
                {
                  "id": 3199,
                  "nome": "Excel: utilizando tabelas dinâmicas e gráficos dinâmicos",
                  "link": "https://cursos.alura.com.br/course/excel-utilizando-tabelas-dinamicas-graficos-dinamicos",
                  "status": "CARREIRA"
                },
                {
                  "id": 3200,
                  "nome": "Excel: automatizando tarefas com Macros",
                  "link": "https://cursos.alura.com.br/course/excel-automatizando-tarefas-macros",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "Praticando Excel",
              "cursos": [
                {
                  "id": 4423,
                  "nome": "Praticando Excel: criando tabelas",
                  "link": "https://cursos.alura.com.br/course/praticando-excel-criando-tabelas",
                  "status": "CARREIRA"
                },
                {
                  "id": 4424,
                  "nome": "Praticando Excel: construindo gráficos",
                  "link": "https://cursos.alura.com.br/course/praticando-excel-construindo-graficos",
                  "status": "CARREIRA"
                },
                {
                  "id": 4425,
                  "nome": "Praticando Excel: utilizando fórmulas matemáticas",
                  "link": "https://cursos.alura.com.br/course/praticando-excel-utilizando-formulas-matematicas",
                  "status": "CARREIRA"
                },
                {
                  "id": 4426,
                  "nome": "Praticando Excel: funções condicionais",
                  "link": "https://cursos.alura.com.br/course/praticando-excel-funcoes-condicionais",
                  "status": "CARREIRA"
                },
                {
                  "id": 4427,
                  "nome": "Praticando Excel: validação de dados",
                  "link": "https://cursos.alura.com.br/course/praticando-excel-validacao-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 4428,
                  "nome": "Praticando Excel: construindo tabelas dinâmicas",
                  "link": "https://cursos.alura.com.br/course/praticando-excel-construindo-tabelas-dinamicas",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Trabalhando com a Linguagem SQL",
          "descricao": "Introduz o conceito de banco de dados relacional e linguagem SQL. Cobre criação de consultas simples: SELECT, filtros (WHERE), ordenação (ORDER BY), limites (LIMIT), e agregações básicas (GROUP BY com funções SUM, AVG, COUNT). Também apresenta conceitos de chave primária/estrangeira e, de forma introdutória, junção de tabelas (JOIN) para combinar dados de duas tabelas simples.",
          "projetos": [
            "Consultas simples em base de funcionários",
            "Relatórios simples com SQL em banco MySQL"
          ],
          "hard_skills": [
            "Consultas SQL básicas (SELECT, WHERE, ORDER BY, LIMIT)",
            "Uso de agregações com GROUP BY (SUM, COUNT, AVG)",
            "Compreensão de chaves primárias e estrangeiras",
            "Junção de tabelas simples com JOIN"
          ],
          "soft_skills": [
            "Pensamento crítico para formular consultas relevantes",
            "Autonomia na navegação e exploração de bancos relacionais",
            "Capacidade de transformar perguntas em instruções de extração de dados"
          ],
          "ferramentas_principais": [
            "SQLite",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "SQLite",
              "cursos": [
                {
                  "id": 3395,
                  "nome": "SQLite Online: executando consultas SQL",
                  "link": "https://cursos.alura.com.br/course/sqlite-online-executando-consultas-sql",
                  "status": "CARREIRA"
                },
                {
                  "id": 3396,
                  "nome": "Realizando consultas com SQL: Joins, Views e transações",
                  "link": "https://cursos.alura.com.br/course/realizando-consultas-sql-joins-views-transacoes",
                  "status": "CARREIRA"
                },
                {
                  "id": 3457,
                  "nome": "SQLite online: análise de dados com SQL",
                  "link": "https://cursos.alura.com.br/course/sqlite-online-analise-dados-sql",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "Praticando SQL",
              "cursos": [
                {
                  "id": 4429,
                  "nome": "Praticando SQL: realizando consultas",
                  "link": "https://cursos.alura.com.br/course/sql-realizando-consultas",
                  "status": "CARREIRA"
                },
                {
                  "id": 4434,
                  "nome": "Praticando SQL: utilizando operadores lógicos",
                  "link": "https://cursos.alura.com.br/course/sql-utilizando-operadores-logicos",
                  "status": "CARREIRA"
                },
                {
                  "id": 4435,
                  "nome": "Praticando SQL: entendendo funções de string",
                  "link": "https://cursos.alura.com.br/course/sql-entendendo-funcoes-string",
                  "status": "CARREIRA"
                },
                {
                  "id": 4436,
                  "nome": "Praticando SQL: entendendo funções numéricas",
                  "link": "https://cursos.alura.com.br/course/sql-entendendo-funcoes-numericas",
                  "status": "CARREIRA"
                },
                {
                  "id": 4437,
                  "nome": "Praticando SQL: trabalhando com funções de Data",
                  "link": "https://cursos.alura.com.br/course/sql-trabalhando-funcoes-data",
                  "status": "CARREIRA"
                },
                {
                  "id": 4438,
                  "nome": "Praticando SQL: funções de agregação",
                  "link": "https://cursos.alura.com.br/course/sql-funcoes-agregacao",
                  "status": "CARREIRA"
                },
                {
                  "id": 4440,
                  "nome": "Praticando SQL: combinando dados com JOINs",
                  "link": "https://cursos.alura.com.br/course/sql-combinando-dados-joins",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Visualização de Dados e Dashboards com Excel e Power BI",
          "descricao": "Apresenta os princípios fundamentais de design para visualização eficaz de dados, incluindo escolha adequada de gráficos, uso consciente de cores e clareza na comunicação visual. Introduz ferramentas de Business Intelligence com foco principal em Microsoft Power BI, e também menciona Tableau e Google Data Studio como alternativas. Ensina a importar dados, criar visualizações interativas e montar um dashboard simples. Também aborda a criação de medidas básicas (soma, média) dentro das ferramentas e noções de compartilhamento de relatórios online.",
          "projetos": [
            "Dashboard inicial de vendas no Power BI",
            "Relatório interativo de indicadores de RH"
          ],
          "hard_skills": [
            "Criação de visualizações e dashboards interativos em ferramentas de BI",
            "Aplicação de boas práticas de design para comunicação visual com dados",
            "Criação de medidas simples (soma, média) dentro da ferramenta"
          ],
          "soft_skills": [
            "Comunicação efetiva de informações por meio de gráficos e painéis",
            "Storytelling com dados para públicos técnicos e não técnicos",
            "Sensibilidade visual para destacar o que realmente importa"
          ],
          "ferramentas_principais": [
            "Excel",
            "Power BI",
            "Power Query",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Excel",
              "cursos": [
                {
                  "id": 4003,
                  "nome": "Dashboards financeiros: da consolidação à visualização estratégica",
                  "link": "https://cursos.alura.com.br/course/dashboards-financeiros-consolidacao-visualizacao-estrategica",
                  "status": "CARREIRA"
                },
                {
                  "id": 4009,
                  "nome": "Data Storytelling: criando narrativas com Excel",
                  "link": "https://cursos.alura.com.br/course/data-storytelling-criando-narrativas-excel",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "Power BI",
              "cursos": [
                {
                  "id": 3775,
                  "nome": "Power BI Desktop: construindo meu primeiro dashboard",
                  "link": "https://cursos.alura.com.br/course/power-bi-desktop-construindo-meu-primeiro-dashboard",
                  "status": "CARREIRA"
                },
                {
                  "id": 3776,
                  "nome": "Power BI Desktop: realizando ETL no Power Query",
                  "link": "https://cursos.alura.com.br/course/power-bi-desktop-realizando-etl-power-query",
                  "status": "CARREIRA"
                },
                {
                  "id": 3777,
                  "nome": "Power BI: construindo cálculos com Dax",
                  "link": "https://cursos.alura.com.br/course/power-bi-construindo-calculos-dax",
                  "status": "CARREIRA"
                },
                {
                  "id": 3778,
                  "nome": "Power BI: visualizando e analisando dados",
                  "link": "https://cursos.alura.com.br/course/power-bi-visualizando-analisando-dados",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "Praticando Power BI",
              "cursos": [
                {
                  "id": 4587,
                  "nome": "Praticando Power BI: transformando dados com Power Query",
                  "link": "https://cursos.alura.com.br/course/praticando-power-bi-transformando-dados-power-query",
                  "status": "CARREIRA"
                },
                {
                  "id": 4588,
                  "nome": "Praticando Power BI: criando métricas com DAX",
                  "link": "https://cursos.alura.com.br/course/praticando-power-bi-criando-metricas-dax",
                  "status": "CARREIRA"
                },
                {
                  "id": 4589,
                  "nome": "Praticando Power BI: criando visualizações estratégicas para responder perguntas de negócio",
                  "link": "https://cursos.alura.com.br/course/praticando-power-bi-criando-visualizacoes-estrategicas-responder-perguntas-negocio",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "nivel": "Iniciante",
      "subnivel": "Nível II",
      "objetivos_gerais": [
        "Aprofundar o uso de SQL para consultas mais complexas.",
        "Introduzir conceitos de programação em Python e R.",
        "Desenvolver projetos práticos de análise de dados com ferramentas modernas."
      ],
      "blocos_tematicos": [
        {
          "nome": "Avançando em Análise de Dados com Planilhas",
          "descricao": "Ensina o uso de planilhas como Excel e Google Sheets para organizar, tratar e analisar dados de forma prática. O conteúdo aborda fórmulas e funções comuns como PROCV/PROCX, SOMASE, SE, entre outras. Também inclui técnicas de limpeza de dados, como remoção de duplicatas e preenchimento de valores ausentes, além da criação de gráficos e dashboards simples diretamente na planilha.",
          "projetos": [
            "Análise de vendas com filtros e tabelas dinâmicas",
            "Limpeza de uma base de dados de clientes em planilha",
            "Dashboard simples de indicadores em excel ou sheets"
          ],
          "hard_skills": [
            "Uso avançado de fórmulas e funções em planilhas (PROCV/PROCX, SOMASE, SE)",
            "Limpeza e organização de dados em Excel ou Google Sheets",
            "Criação de gráficos e dashboards simples em planilhas"
          ],
          "soft_skills": [
            "Resolução prática de problemas com ferramentas acessíveis",
            "Curiosidade para explorar recursos avançados de planilhas",
            "Precisão e atenção aos detalhes na manipulação de dados"
          ],
          "ferramentas_principais": [
            "Excel",
            "Power Pivot",
            "Power Query",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Microsoft Excel",
              "cursos": [
                {
                  "id": 2908,
                  "nome": "BI com Excel: criando bancos de dados com planilhas",
                  "link": "https://cursos.alura.com.br/course/bi-excel-crie-bancos-dados-planilhas",
                  "status": "CARREIRA"
                },
                {
                  "id": 2909,
                  "nome": "BI com Excel: criando um Dashboard sem complicação",
                  "link": "https://cursos.alura.com.br/course/bi-excel-criando-dashboard-sem-complicacao",
                  "status": "CARREIRA"
                },
                {
                  "id": 2910,
                  "nome": "BI com Excel: trabalhando com tabelas dinâmicas com Power Pivot",
                  "link": "https://cursos.alura.com.br/course/bi-excel-tabelas-dinamicas-power-pivot",
                  "status": "CARREIRA"
                },
                {
                  "id": 2911,
                  "nome": "BI com Excel: criando Dashboard com Power Pivot",
                  "link": "https://cursos.alura.com.br/course/bi-excel-dashboard-power-pivot",
                  "status": "CARREIRA"
                },
                {
                  "id": 2912,
                  "nome": "BI com Excel: conhecendo o Power Query",
                  "link": "https://cursos.alura.com.br/course/bi-excel-power-query",
                  "status": "CARREIRA"
                },
                {
                  "id": 2913,
                  "nome": "BI com Excel: dashboard com Power Query",
                  "link": "https://cursos.alura.com.br/course/excel-dashboards-power-query",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "VBA",
              "cursos": [
                {
                  "id": 3636,
                  "nome": "VBA: automatizando tarefas diárias sem ser Dev",
                  "link": "https://cursos.alura.com.br/course/vba-automatizando-tarefas-diarias-sem-ser-dev",
                  "status": "CARREIRA"
                },
                {
                  "id": 3637,
                  "nome": "VBA: manipulação e limpeza de dados",
                  "link": "https://cursos.alura.com.br/course/vba-manipulacao-limpeza-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 3690,
                  "nome": "VBA: fazendo um cadastro personalizado",
                  "link": "https://cursos.alura.com.br/course/vba-fazendo-cadastro-personalizado",
                  "status": "CARREIRA"
                },
                {
                  "id": 3691,
                  "nome": "VBA: automatizando a comparação entre planilhas e dados",
                  "link": "https://cursos.alura.com.br/course/vba-automatizando-comparacao-planilhas-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 3692,
                  "nome": "VBA : integrando Outlook com IA's",
                  "link": "https://cursos.alura.com.br/course/vba-integrando-outlook-ias",
                  "status": "CARREIRA"
                },
                {
                  "id": 3693,
                  "nome": "VBA: aplicando IA para automação e análise de dados",
                  "link": "https://cursos.alura.com.br/course/vba-aplicando-ia-automacao-analise-dados",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Introdução à Programação para Análise de Dados",
          "descricao": "Apresenta os fundamentos da programação voltados à análise de dados, permitindo ao aluno escolher entre Python ou R como linguagem principal. Cobre tipos de dados primitivos, estruturas de controle (condicionais e loops), e operações básicas de manipulação de dados. Também aborda a leitura de arquivos CSV, seleção de colunas, filtros e transformações simples utilizando bibliotecas como pandas (Python) ou dplyr/tidyverse (R).",
          "projetos": [
            "Leitura e análise de arquivos CSV com Python.",
            "Limpeza de dados e geração de gráficos em R."
          ],
          "hard_skills": [
            "Programação básica com foco em dados (Python ou R)",
            "Leitura e manipulação de arquivos CSV",
            "Data wrangling com bibliotecas específicas (pandas ou dplyr)"
          ],
          "soft_skills": [
            "Curiosidade para explorar diferentes abordagens com linguagens de programação",
            "Aprendizado contínuo no uso de ferramentas de análise",
            "Autonomia na resolução de problemas com apoio de código"
          ],
          "ferramentas_principais": [
            "Python",
            "R",
            "Google Colab",
            "VS Code",
            "Git",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos": [
                {
                  "id": 2925,
                  "nome": "Pandas: conhecendo a biblioteca",
                  "link": "https://cursos.alura.com.br/course/pandas-conhecendo-biblioteca",
                  "status": "CARREIRA"
                },
                {
                  "id": 2926,
                  "nome": "Pandas I/O: trabalhando com diferentes formatos de arquivos",
                  "link": "https://cursos.alura.com.br/course/pandas-io-trabalhando-diferentes-formatos-arquivos",
                  "status": "CARREIRA"
                },
                {
                  "id": 2927,
                  "nome": "Pandas: selecionando e agrupando dados",
                  "link": "https://cursos.alura.com.br/course/pandas-selecao-agrupamento-dados",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "Praticando Pandas",
              "cursos": [
                {
                  "id": 4418,
                  "nome": "Praticando Pandas: realizando operações",
                  "link": "https://cursos.alura.com.br/course/praticando-python-realizando-operacoes",
                  "status": "CARREIRA"
                },
                {
                  "id": 4474,
                  "nome": "Praticando Pandas: criando tabulações com pivot_table",
                  "link": "https://cursos.alura.com.br/course/python-criando-tabulacoes-pivot-table",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "R",
              "cursos": [
                {
                  "id": 3683,
                  "nome": "R para Data Science: conhecendo a linguagem",
                  "link": "https://cursos.alura.com.br/course/r-data-science-conhecendo-linguagem",
                  "status": "COMPLEMENTO"
                },
                {
                  "id": 3684,
                  "nome": "R: utilizando e manipulando estruturas para análises de dados",
                  "link": "https://cursos.alura.com.br/course/r-utilizando-manipulando-estruturas-analises-dados",
                  "status": "COMPLEMENTO"
                }
              ]
            }
          ]
        },
        {
          "nome": "Dominando Visualização de Dados e Dashboards com Power BI",
          "descricao": "Apresenta os princípios fundamentais de design para visualização eficaz de dados, incluindo escolha adequada de gráficos, uso consciente de cores e clareza na comunicação visual. Introduz ferramentas de Business Intelligence com foco principal em Microsoft Power BI, e também menciona Tableau e Google Data Studio como alternativas. Ensina a importar dados, criar visualizações interativas e montar um dashboard simples. Também aborda a criação de medidas básicas (soma, média) dentro das ferramentas e noções de compartilhamento de relatórios online.",
          "projetos": [
            "Dashboard inicial de vendas no Power BI",
            "Relatório interativo de indicadores de RH"
          ],
          "hard_skills": [
            "Criação de visualizações e dashboards interativos em ferramentas de BI",
            "Aplicação de boas práticas de design para comunicação visual com dados",
            "Criação de medidas simples (soma, média) dentro da ferramenta"
          ],
          "soft_skills": [
            "Comunicação efetiva de informações por meio de gráficos e painéis",
            "Storytelling com dados para públicos técnicos e não técnicos",
            "Sensibilidade visual para destacar o que realmente importa"
          ],
          "ferramentas_principais": [
            "Power BI",
            "Linguagem M",
            "DAX",
            "Python",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Power BI",
              "cursos": [
                {
                  "id": 2672,
                  "nome": "Power BI: mergulhando na linguagem M",
                  "link": "https://cursos.alura.com.br/course/power-bi-mergulhando-linguagem-m",
                  "status": "CARREIRA"
                },
                {
                  "id": 2788,
                  "nome": "Power BI: modelagem de dados",
                  "link": "https://cursos.alura.com.br/course/power-bi-modelagem-dados"
                },
                {
                  "id": 2673,
                  "nome": "Power BI: DAX contextos e iteração",
                  "link": "https://cursos.alura.com.br/course/power-bi-dax-contextos-iteracao",
                  "status": "CARREIRA"
                },
                {
                  "id": 3139,
                  "nome": "Power BI: aprofundando na linguagem DAX",
                  "link": "https://cursos.alura.com.br/course/power-bi-aprofundando-linguagem-dax",
                  "status": "CARREIRA"
                },
                {
                  "id": 2816,
                  "nome": "Power BI: aplicando DAX ao negócio",
                  "link": "https://cursos.alura.com.br/course/power-bi-aplicando-dax-negocio",
                  "status": "CARREIRA"
                },
                {
                  "id": 2952,
                  "nome": "Power BI: criando visuais customizados",
                  "link": "https://cursos.alura.com.br/course/power-bi-criando-visuais-customizados",
                  "status": "CARREIRA"
                },
                {
                  "id": 3059,
                  "nome": "Python e Power BI: analisando dados do mercado financeiro",
                  "link": "https://cursos.alura.com.br/course/python-power-bi-dados-mercado-financeiro",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Utilizando Técincas Estatísticas para Descrever os Dados",
          "descricao": "Apresenta técnicas de estatística descritiva e diagnóstica aplicadas à análise de dados, com o objetivo de entender padrões e possíveis causas por trás de fenômenos observados. O foco está na exploração de métricas como médias, proporções, variações e na comparação entre grupos ou períodos. Aborda também o uso de visualizações, tabelas dinâmicas e segmentações como apoio à interpretação diagnóstica.",
          "projetos": [
            "Análise de churn de clientes com Python e SQL.",
            "Identificação de padrões de vendas sazonais em planilhas e dashboards."
          ],
          "hard_skills": [
            "Estatística descritiva aplicada à análise de dados",
            "Análise diagnóstica com segmentações e comparação de grupos",
            "Uso de SQL, Python e dashboards para investigar padrões e causas"
          ],
          "soft_skills": [
            "Pensamento crítico voltado à identificação de causas e padrões",
            "Visão de negócio para interpretar indicadores no contexto estratégico",
            "Capacidade de sintetizar achados e apresentar hipóteses baseadas em dados"
          ],
          "ferramentas_principais": [
            "Excel",
            "Power BI",
            "Python",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Excel",
              "cursos": [
                {
                  "id": 0,
                  "nome": "Estatística com Excel e Power BI: Fazendo uma análise descritiva completa",
                  "link": "https://cursos.alura.com.br/",
                  "status": "NOVIDADE"
                }
              ]
            },
            {
              "stack": "Python",
              "cursos": [
                {
                  "id": 4217,
                  "nome": "Estatística com Python: resumindo e analisando dados",
                  "link": "https://cursos.alura.com.br/course/estatistica-python-resumindo-analisando-dados",
                  "status": "REGRAVAÇÃO"
                },
                {
                  "id": 3675,
                  "nome": "Data Science: explorando e analisando dados",
                  "link": "https://cursos.alura.com.br/course/data-science-explorando-analisando-dados",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "R",
              "cursos": [
                {
                  "id": 4194,
                  "nome": "Estatística com R: resumindo e analisando dados",
                  "link": "https://cursos.alura.com.br/course/estatistica-r-resumindo-analisando-dados",
                  "status": "COMPLEMENTO"
                },
                {
                  "id": 3818,
                  "nome": "R: aplicando a análise descritiva com R",
                  "link": "https://cursos.alura.com.br/course/r-aplicando-analise-descritiva-r",
                  "status": "COMPLEMENTO"
                }
              ]
            }
          ]
        },
        {
          "nome": "Trabalhando com MySQL para Análise de Dados",
          "descricao": "Introduz o conceito de banco de dados relacional e linguagem SQL. Cobre criação de consultas simples: SELECT, filtros (WHERE), ordenação (ORDER BY), limites (LIMIT), e agregações básicas (GROUP BY com funções SUM, AVG, COUNT). Também apresenta conceitos de chave primária/estrangeira e, de forma introdutória, junção de tabelas (JOIN) para combinar dados de duas tabelas simples.",
          "projetos": [
            "Consultas simples em base de funcionários",
            "Relatórios simples com SQL em banco MySQL"
          ],
          "hard_skills": [
            "Consultas SQL básicas (SELECT, WHERE, ORDER BY, LIMIT)",
            "Uso de agregações com GROUP BY (SUM, COUNT, AVG)",
            "Compreensão de chaves primárias e estrangeiras",
            "Junção de tabelas simples com JOIN"
          ],
          "soft_skills": [
            "Pensamento crítico para formular consultas relevantes",
            "Autonomia na navegação e exploração de bancos relacionais",
            "Capacidade de transformar perguntas em instruções de extração de dados"
          ],
          "ferramentas_principais": [
            "MySQL",
            "PostgreSQL",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "MySQL",
              "cursos": [
                {
                  "id": 3679,
                  "nome": "MySQL: conhecendo a ferramenta",
                  "link": "https://cursos.alura.com.br/course/mysql-conhecendo-ferramenta",
                  "status": "CARREIRA"
                },
                {
                  "id": 3680,
                  "nome": "MySQL: executando Procedures",
                  "link": "https://cursos.alura.com.br/course/banco-dados-mysql-executando-procedures",
                  "status": "CARREIRA"
                },
                {
                  "id": 3681,
                  "nome": "MySQL: trabalhando com funções",
                  "link": "https://cursos.alura.com.br/course/mysql-trabalhando-funcoes",
                  "status": "CARREIRA"
                },
                {
                  "id": 3682,
                  "nome": "MySQL: aplicado para análise de dados",
                  "link": "https://cursos.alura.com.br/course/mysql-aplicado-analise-dados",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "Python",
              "cursos": [
                {
                  "id": 3058,
                  "nome": "Python: análise de dados com SQL",
                  "link": "https://cursos.alura.com.br/course/python-analise-dados-sql",
                  "status": "COMPLEMENTO"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "nivel": "Iniciante",
      "subnivel": "Nível III",
      "objetivos_gerais": [
        "Consolidar o uso de planilhas, SQL e programação para análise de dados.",
        "Realizar análises descritivas e diagnósticas de dados reais.",
        "Apresentar resultados de forma clara e visual."
      ],
      "blocos_tematicos": [
        {
          "nome": "Limpeza e Transformação de Dados",
          "descricao": "Foca nas principais técnicas de data wrangling aplicadas com Python (usando pandas) ou R (com dplyr). Ensina a identificar e tratar valores ausentes, corrigir tipos de dados (como conversão de strings em datas), remover outliers simples, padronizar categorias e rótulos, criar colunas derivadas e unir diferentes conjuntos de dados. O objetivo é preparar os dados para análises mais avançadas e garantir consistência e qualidade nas bases utilizadas.",
          "projetos": [
            "Limpando dados de pesquisa",
            "Limpeza e análise inicial de dados",
            "Mesclando e enriquecendo conjuntos de dados"
          ],
          "hard_skills": [
            "Tratamento de dados faltantes e normalização de variáveis",
            "Correção de tipos de dados e padronização de categorias",
            "Fusão de datasets com merge/join programático",
            "Criação de colunas derivadas para análises específicas"
          ],
          "soft_skills": [
            "Curiosidade para entender a estrutura e qualidade dos dados",
            "Aprendizado contínuo no uso de bibliotecas e boas práticas de wrangling",
            "Autonomia na preparação de dados para diferentes contextos analíticos"
          ],
          "ferramentas_principais": [
            "Python",
            "R",
            "Google Colab",
            "Git",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos": [
                {
                  "id": 2929,
                  "nome": "Pandas: limpeza e tratamento de dados",
                  "link": "https://cursos.alura.com.br/course/pandas-limpeza-tratamento-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 2928,
                  "nome": "Pandas: transformação e manipulação de dados",
                  "link": "https://cursos.alura.com.br/course/pandas-transformacao-manipulacao-dados",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "Praticando Pandas",
              "cursos": [
                {
                  "id": 4419,
                  "nome": "Praticando Pandas: trabalhando com dados nulos",
                  "link": "https://cursos.alura.com.br/course/python-trabalhando-dados-nulos",
                  "status": "CARREIRA"
                },
                {
                  "id": 4416,
                  "nome": "Praticando Pandas: normalizando arquivos JSON",
                  "link": "https://cursos.alura.com.br/course/python-normalizando-arquivos-json",
                  "status": "CARREIRA"
                },
                {
                  "id": 4417,
                  "nome": "Praticando Pandas: criando tabulações com groupby",
                  "link": "https://cursos.alura.com.br/course/python-criando-tabulacoes-groupby",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "R",
              "cursos": [
                {
                  "id": 3816,
                  "nome": "R: utilizando o Tidyverse para diferentes formatos de dados",
                  "link": "https://cursos.alura.com.br/course/r-utilizando-tidyverse-diferentes-formatos-dados",
                  "status": "COMPLEMENTO"
                },
                {
                  "id": 3817,
                  "nome": "R: utilizando o Tidyverse e transformando dados com dplyr",
                  "link": "https://cursos.alura.com.br/course/r-utilizando-tidyverse-transformando-dados-dplyr",
                  "status": "COMPLEMENTO"
                }
              ]
            }
          ]
        },
        {
          "nome": "Dominando Análise de Dados com Planilhas",
          "descricao": "Ensina o uso de planilhas como Excel e Google Sheets para organizar, tratar e analisar dados de forma prática. O conteúdo aborda fórmulas e funções comuns como PROCV/PROCX, SOMASE, SE, entre outras. Também inclui técnicas de limpeza de dados, como remoção de duplicatas e preenchimento de valores ausentes, além da criação de gráficos e dashboards simples diretamente na planilha.",
          "projetos": [
            "Análise de vendas com filtros e tabelas dinâmicas",
            "Limpeza de uma base de dados de clientes em planilha",
            "Dashboard simples de indicadores em excel ou sheets"
          ],
          "hard_skills": [
            "Uso avançado de fórmulas e funções em planilhas (PROCV/PROCX, SOMASE, SE)",
            "Limpeza e organização de dados em Excel ou Google Sheets",
            "Criação de gráficos e dashboards simples em planilhas"
          ],
          "soft_skills": [
            "Resolução prática de problemas com ferramentas acessíveis",
            "Curiosidade para explorar recursos avançados de planilhas",
            "Precisão e atenção aos detalhes na manipulação de dados"
          ],
          "ferramentas_principais": [
            "Excel",
            "Google Sheets",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Microsoft Excel",
              "cursos": [
                {
                  "id": 0,
                  "nome": "Excel para analistas de dados: construindo um projeto de análise de dados completo",
                  "link": "https://cursos.alura.com.br/course/excel-aplicado-mercado-financeiro-dashboards-realizando-consultas",
                  "status": "NOVIDADE"
                },
                {
                  "id": 1008,
                  "nome": "Excel: simulação e análise de cenários",
                  "link": "https://cursos.alura.com.br/course/excel-simulacao-e-analise-de-cenarios",
                  "status": "COMPLEMENTO"
                },
                {
                  "id": 3719,
                  "nome": "Excel aplicado ao mercado financeiro: construindo dashboards e realizando consultas",
                  "link": "https://cursos.alura.com.br/course/excel-aplicado-mercado-financeiro-dashboards-realizando-consultas",
                  "status": "COMPLEMENTO"
                },
                {
                  "id": 4002,
                  "nome": "Análise financeira eficiente: automatize o Excel com Power Query e Power Pivot",
                  "link": "https://cursos.alura.com.br/course/analise-financeira-eficiente-automatize-excel-power-query-power-pivot",
                  "status": "COMPLEMENTO"
                },
                {
                  "id": 4247,
                  "nome": "Excel para RH: construindo seu primeiro relatório",
                  "link": "https://cursos.alura.com.br/course/excel-rh-construindo-primeiro-relatorio",
                  "status": "COMPLEMENTO"
                },
                {
                  "id": 4248,
                  "nome": "Excel avançado para RH: funções, análises e dashboards estratégicos",
                  "link": "https://cursos.alura.com.br/course/excel-avancado-rh-funcoes-analises-dashboards-estrategicos",
                  "status": "COMPLEMENTO"
                },
                {
                  "id": 4249,
                  "nome": "Excel estratégico para RH: automação, macros e planejamento avançado",
                  "link": "https://cursos.alura.com.br/course/excel-estrategico-rh-automacao-macros-planejamento-avancado",
                  "status": "COMPLEMENTO"
                }
              ]
            },
            {
              "stack": "Google Sheets",
              "cursos": [
                {
                  "id": 1867,
                  "nome": "Data Analysis: Google Sheets",
                  "link": "https://cursos.alura.com.br/course/data-analysis-introducao-google-sheets",
                  "status": "COMPLEMENTO"
                },
                {
                  "id": 2011,
                  "nome": "Data Analysis: previsões com Google Sheets",
                  "link": "https://cursos.alura.com.br/course/data-analysis-previsoes-google-sheets",
                  "status": "COMPLEMENTO"
                },
                {
                  "id": 2140,
                  "nome": "Data Analysis: estatística com Google Sheets",
                  "link": "https://cursos.alura.com.br/course/data-analysis-estatistica-google-sheets",
                  "status": "COMPLEMENTO"
                },
                {
                  "id": 4148,
                  "nome": "Automação e análise com Google Sheets: dados financeiros em tempo real",
                  "link": "https://cursos.alura.com.br/course/automacao-analise-google-sheets-dados-financeiros-tempo-real",
                  "status": "COMPLEMENTO"
                }
              ]
            }
          ]
        },
        {
          "nome": "Trabalhando com Oracle Database para Análise de Dados",
          "descricao": "Introduz o conceito de banco de dados relacional e linguagem SQL. Cobre criação de consultas simples: SELECT, filtros (WHERE), ordenação (ORDER BY), limites (LIMIT), e agregações básicas (GROUP BY com funções SUM, AVG, COUNT). Também apresenta conceitos de chave primária/estrangeira e, de forma introdutória, junção de tabelas (JOIN) para combinar dados de duas tabelas simples.",
          "projetos": [
            "Consultas simples em base de funcionários",
            "Relatórios simples com SQL em banco MySQL"
          ],
          "hard_skills": [
            "Consultas SQL básicas (SELECT, WHERE, ORDER BY, LIMIT)",
            "Uso de agregações com GROUP BY (SUM, COUNT, AVG)",
            "Compreensão de chaves primárias e estrangeiras",
            "Junção de tabelas simples com JOIN"
          ],
          "soft_skills": [
            "Pensamento crítico para formular consultas relevantes",
            "Autonomia na navegação e exploração de bancos relacionais",
            "Capacidade de transformar perguntas em instruções de extração de dados"
          ],
          "ferramentas_principais": [
            "MySQL",
            "PostgreSQL",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Oracle",
              "cursos": [
                {
                  "id": 2579,
                  "nome": "SQL com Oracle Database: manipule e consulte dados",
                  "link": "https://cursos.alura.com.br/course/introducao-sql-oracle-manipule-consulte-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 2580,
                  "nome": "Oracle Database: projeções, seleções, joins e views",
                  "link": "https://cursos.alura.com.br/course/sql-oracle-projecoes-selecoes-joins-views",
                  "status": "CARREIRA"
                },
                {
                  "id": 2581,
                  "nome": "Oracle Database: manipulando dados com comandos DML",
                  "link": "https://cursos.alura.com.br/course/manipulacao-dados-oracle-dml",
                  "status": "CARREIRA"
                },
                {
                  "id": 2582,
                  "nome": "Oracle PL/SQL: procedures, funções e exceções",
                  "link": "https://cursos.alura.com.br/course/oracle-pl-sql-procedures-funcoes-excecoes",
                  "status": "CARREIRA"
                },
                {
                  "id": 2607,
                  "nome": "Oracle PL/SQL: cursor e exceções",
                  "link": "https://cursos.alura.com.br/course/oracle-pl-sql-cursor-excecoes",
                  "status": "CARREIRA"
                },
                {
                  "id": 2583,
                  "nome": "Oracle PL/SQL: dominando packages",
                  "link": "https://cursos.alura.com.br/course/oracle-pl-sql-dominando-packages",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Uso de Tecnologias Emergentes na Análise de Dados",
          "descricao": "Explora o uso e a integração de tecnologias emergentes, com destaque para ferramentas de Inteligência Artificial aplicadas à análise de dados. Apresenta formas práticas de utilizar assistentes de IA generativa no apoio à exploração de dados, interpretação de resultados, automação de análises e geração de relatórios. O objetivo é ampliar a capacidade analítica com criatividade e uso estratégico dessas ferramentas.",
          "projetos": [
            "Análise assistida por IA com dados públicos"
          ],
          "hard_skills": [
            "Integração de ferramentas de IA em fluxos analíticos",
            "Uso de modelos generativos para apoio em análise de dados",
            "Aplicação de Python com suporte de assistentes inteligentes"
          ],
          "soft_skills": [
            "Criatividade para explorar novas possibilidades com IA",
            "Resolução de problemas com apoio tecnológico",
            "Abertura à experimentação e aprendizagem contínua"
          ],
          "ferramentas_principais": [
            "OpenAI",
            "Gemini",
            "Grok",
            "Copilot",
            "Deepseek",
            "Python",
            "Power BI",
            "Excel"
          ],
          "cursos": [
            {
              "stack": "Análise de Dados",
              "cursos": [
                {
                  "id": 4165,
                  "nome": "LlamaIndex: analisando dados com Pandas",
                  "link": "https://cursos.alura.com.br/course/llamaIndex-analisando-dados-pandas",
                  "status": "CARREIRA"
                },
                {
                  "id": 4166,
                  "nome": "LlamaIndex: criando um assistente virtual para consulta de banco de dados",
                  "link": "https://cursos.alura.com.br/course/llamaIndex-criando-assistente-virtual-consulta-banco-dados",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "Power Automate",
              "cursos": [
                {
                  "id": 0,
                  "nome": "Power Automate: Automatizando tarefas de um analista de dados",
                  "link": "https://cursos.alura.com.br/",
                  "status": "NOVIDADE"
                }
              ]
            }
          ]
        },
        {
          "nome": "Projeto Integrador (Conclusão do Nível Iniciante)",
          "descricao": "Consolida os principais aprendizados do nível iniciante por meio da realização de um projeto completo de análise de dados. O aluno é desafiado a aplicar todas as etapas do processo analítico — desde a obtenção e limpeza dos dados (ETL) até a análise, visualização e comunicação dos resultados. Enfatiza o planejamento do projeto, a divisão lógica das etapas e a apresentação final em formato de relatório ou narrativa com storytelling, contextualizando o problema e destacando os principais insights.",
          "projetos": [
            "Análise completa de dados de negócio"
          ],
          "hard_skills": [
            "Integração de etapas ETL com ferramentas adequadas",
            "Data wrangling e análise exploratória de dados",
            "Criação de dashboards e visualizações eficazes",
            "Storytelling com dados aplicados a problemas de negócio"
          ],
          "soft_skills": [
            "Gerenciamento e organização de projeto de análise de ponta a ponta",
            "Pensamento holístico, conectando dados aos objetivos estratégicos",
            "Comunicação clara e orientada a públicos técnicos e não técnicos"
          ],
          "ferramentas_principais": [
            "Excel",
            "Power BI",
            "Python",
            "R",
            "SQL",
            "Google Colab",
            "VS Code",
            "Git",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos": [
                {
                  "id": 4712,
                  "nome": "Challenge Telecom X: análise de evasão de clientes",
                  "link": "https://cursos.alura.com.br/course/challenge-telecom-x-analise-evasao-clientes",
                  "status": "ATIVO"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "nivel": "Intermediário",
      "subnivel": "Nível I",
      "objetivos_gerais": [
        "Aprofundar técnicas de manipulação e integração de dados.",
        "Utilizar ferramentas ETL/ELT para automação de processos.",
        "Desenvolver análises preditivas iniciais."
      ],
      "blocos_tematicos": [
        {
          "nome": "Coleta de Dados em Fontes Externas",
          "descricao": "Apresenta técnicas fundamentais para obtenção de dados fora de bases locais, com foco no consumo de APIs REST e na aplicação de web scraping. O conteúdo cobre como acessar dados em formatos como JSON e XML, salvar em arquivos estruturados (CSV/JSON) e prepará-los para análises posteriores. Também discute aspectos éticos e boas práticas na coleta automatizada de dados.",
          "projetos": [
            "Consumo de API pública com Python",
            "Web scraping com BeautifulSoup"
          ],
          "hard_skills": [
            "Consumo de APIs REST e leitura de dados em JSON ou XML",
            "Manipulação e transformação de dados não estruturados",
            "Extração de dados com web scraping usando Python",
            "Armazenamento e preparação dos dados em SQL ou arquivos tabulares"
          ],
          "soft_skills": [
            "Curiosidade técnica para explorar fontes de dados externas",
            "Ética e responsabilidade na coleta automatizada de informações",
            "Capacidade de resolver problemas práticos com autonomia"
          ],
          "ferramentas_principais": [
            "Python",
            "SQL",
            "Postman",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos": [
                {
                  "id": 3053,
                  "nome": "Python e APIs: conhecendo a biblioteca Requests",
                  "link": "https://cursos.alura.com.br/course/python-apis-conhecendo-biblioteca-requests",
                  "status": "CARREIRA"
                },
                {
                  "id": 3054,
                  "nome": "Streamlit: construindo um dashboard interativo",
                  "link": "https://cursos.alura.com.br/course/streamlit-construindo-dashboard-interativo"
                }
              ]
            }
          ]
        },
        {
          "nome": "Trabalhando com PostgreSQL para Análise de Dados",
          "descricao": "Introduz o conceito de banco de dados relacional e linguagem SQL. Cobre criação de consultas simples: SELECT, filtros (WHERE), ordenação (ORDER BY), limites (LIMIT), e agregações básicas (GROUP BY com funções SUM, AVG, COUNT). Também apresenta conceitos de chave primária/estrangeira e, de forma introdutória, junção de tabelas (JOIN) para combinar dados de duas tabelas simples.",
          "projetos": [
            "Consultas simples em base de funcionários",
            "Relatórios simples com SQL em banco MySQL"
          ],
          "hard_skills": [
            "Consultas SQL básicas (SELECT, WHERE, ORDER BY, LIMIT)",
            "Uso de agregações com GROUP BY (SUM, COUNT, AVG)",
            "Compreensão de chaves primárias e estrangeiras",
            "Junção de tabelas simples com JOIN"
          ],
          "soft_skills": [
            "Pensamento crítico para formular consultas relevantes",
            "Autonomia na navegação e exploração de bancos relacionais",
            "Capacidade de transformar perguntas em instruções de extração de dados"
          ],
          "ferramentas_principais": [
            "MySQL",
            "PostgreSQL",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "PostgreSQL",
              "cursos": [
                {
                  "id": 1659,
                  "nome": "PostgreSQL",
                  "link": "https://cursos.alura.com.br/course/introducao-postgresql-primeiros-passos",
                  "status": "CARREIRA"
                },
                {
                  "id": 1878,
                  "nome": "PostgreSQL: Views, Sub-Consultas e Funções",
                  "link": "https://cursos.alura.com.br/course/postgresql-views-sub-consultas-funcoes",
                  "status": "CARREIRA"
                },
                {
                  "id": 1887,
                  "nome": "PostgreSQL: comandos DML e DDL",
                  "link": "https://cursos.alura.com.br/course/pgsql-comandos-dml-ddl",
                  "status": "CARREIRA"
                },
                {
                  "id": 1899,
                  "nome": "PostgreSQL: desenvolva com PL/pgSQL",
                  "link": "https://cursos.alura.com.br/course/postgresql-procedures",
                  "status": "CARREIRA"
                },
                {
                  "id": 1900,
                  "nome": "PostgreSQL: Triggers, transações, erros e cursores",
                  "link": "https://cursos.alura.com.br/course/postgresql-triggers-transacoes-erros-cursores",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Testando Hipóteses com os Dados",
          "descricao": "Foca em conceitos estatísticos necessários para validar conclusões em análise de dados. Aborda distribuição de probabilidades (por exemplo, normal), conceitos de amostragem e margem de erro. Introduz testes de hipótese (t-test, qui-quadrado de forma prática) e interpretação de valor-p (p-value) e intervalos de confiança. Em seguida, introduz modelagem preditiva básica com ênfase em regressão linear simples e múltipla: como ajustar um modelo, interpretar coeficientes e avaliar a qualidade do modelo (R², erro médio). Também discute brevemente limitações e supostos dos modelos, enfatizando a importância de não confundir correlação com causalidade.",
          "projetos": [
            "Análise de distribuições em um dataset",
            "Aplicação de testes de hipótese",
            "Previsões com modelos de regressão linear"
          ],
          "hard_skills": [
            "Aplicação de testes estatísticos (significância, p-valor, intervalos de confiança)",
            "Construção e interpretação de modelos de regressão linear",
            "Uso de software estatístico ou bibliotecas para análise (Statsmodels/Scikit-learn em Python ou stats/R em R)"
          ],
          "soft_skills": [
            "Pensamento crítico",
            "Tomada de decisão baseada em dados"
          ],
          "ferramentas_principais": [
            "Python",
            "Excel",
            "Google Colab",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos": [
                {
                  "id": 1178,
                  "nome": "Estatística com Python: probabilidade e amostragem",
                  "link": "https://cursos.alura.com.br/course/estatistica-probabilidade-e-amostragem",
                  "status": "CARREIRA"
                },
                {
                  "id": 1229,
                  "nome": "Estatística com Python: testes de hipóteses",
                  "link": "https://cursos.alura.com.br/course/estatistica-testes-hipotestes",
                  "status": "CARREIRA"
                },
                {
                  "id": 1112,
                  "nome": "Data Science: testes estatísticos com Python",
                  "link": "https://cursos.alura.com.br/course/data-science-introducao-a-testes-estatisticos-com-python",
                  "status": "CARREIRA"
                },
                {
                  "id": 3676,
                  "nome": "Data Science: testando hipóteses",
                  "link": "https://cursos.alura.com.br/course/data-science-testando-hipoteses",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "R",
              "cursos": [
                {
                  "id": 4195,
                  "nome": "Estatística com R: aplicando a probabilidade e a amostragem dos dados",
                  "link": "https://cursos.alura.com.br/course/estatistica-r-aplicando-probabilidade-amostragem-dados",
                  "status": "COMPLEMENTO"
                },
                {
                  "id": 4196,
                  "nome": "Estatística com R: aplicando testes de hipóteses",
                  "link": "https://cursos.alura.com.br/course/estatistica-r-aplicando-testes-hipoteses",
                  "status": "COMPLEMENTO"
                }
              ]
            }
          ]
        },
        {
          "nome": "Dominando Visualização de Dados e Dashboards com Tableau",
          "descricao": "Aprofunda o uso de ferramentas de BI e técnicas de visualização. Cobre a modelagem de dados dentro de ferramentas de BI (relacionamento entre tabelas, criação de modelos estrela simples para relatórios). Ensina a criar medidas e cálculos avançados (como métricas de comparação temporal: crescimento ano a ano, médias móveis) usando linguagens como DAX no Power BI ou cálculos equivalentes no Tableau. Explora visualizações avançadas (mapas geográficos, gráfico de dispersão com múltiplas medidas) e customização de dashboards para diferentes audiências. Também aborda práticas de publicação e atualização de dashboards online de forma profissional (configuração de atualização de dados, gerenciamento de acessos). Criação de dashboards interativos e narrativas visuais impactantes para tomada de decisão.",
          "projetos": [
            "Dashboard executivo para diretoria",
            "Storytelling de dados para resultados de negócio.",
            "Dashboard multidimensional de vendas",
            "Relatório geográfico e temporal interativo"
          ],
          "hard_skills": [
            "Modelagem de dados para BI (relacionamentos, modelo estrela)",
            "Criação de métricas avançadas em DAX ou linguagem equivalente",
            "Design e personalização de dashboards interativos",
            "Storytelling com dados aplicados a contextos executivos"
          ],
          "soft_skills": [
            "Visão de produto na construção de relatórios e painéis",
            "Comunicação eficaz com diferentes públicos (técnico e executivo)",
            "Capacidade de conectar insights de dados com objetivos de negócio"
          ],
          "ferramentas_principais": [
            "Tableau",
            "Power BI",
            "Python",
            "Plotly",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Tableau",
              "cursos": [
                {
                  "id": 2234,
                  "nome": "Dashboard com Tableau: conceitos essenciais",
                  "link": "https://cursos.alura.com.br/course/tableau-conceitos-essenciais",
                  "status": "CARREIRA"
                },
                {
                  "id": 2235,
                  "nome": "Tableau: preparação e transformação de dados",
                  "link": "https://cursos.alura.com.br/course/tableau-preparacao-transformacao-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 2236,
                  "nome": "Tableau: funções e cálculos LoD",
                  "link": "https://cursos.alura.com.br/course/tableau-funcoes-calculos-lod",
                  "status": "CARREIRA"
                },
                {
                  "id": 2237,
                  "nome": "Tableau: gráficos simples e avançados",
                  "link": "https://cursos.alura.com.br/course/tableau-graficos-simples-avancados",
                  "status": "CARREIRA"
                },
                {
                  "id": 2269,
                  "nome": "Tableau: como trabalhar com mapas",
                  "link": "https://cursos.alura.com.br/course/tableau-como-trabalhar-mapas",
                  "status": "CARREIRA"
                },
                {
                  "id": 2270,
                  "nome": "Tableau: construindo dashboards e histórias",
                  "link": "https://cursos.alura.com.br/course/tableau-construindo-dashboards-historias",
                  "status": "CARREIRA"
                },
                {
                  "id": 2335,
                  "nome": "Tableau: executando um projeto de BI",
                  "link": "https://cursos.alura.com.br/course/tableau-executando-projeto-bi",
                  "status": "CARREIRA"
                },
                {
                  "id": 3980,
                  "nome": "Data Storytelling: investigando e apresentando dados com Tableau",
                  "link": "https://cursos.alura.com.br/course/data-storytelling-investigando-apresentando-dados-tableau",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "nivel": "Intermediário",
      "subnivel": "Nível II",
      "objetivos_gerais": [
        "Trabalhar com grandes volumes de dados e ambientes de Big Data.",
        "Utilizar ferramentas de computação em nuvem para análise de dados.",
        "Aprofundar a visualização e storytelling com dados."
      ],
      "blocos_tematicos": [
        {
          "nome": "Visualização de Dados com Python",
          "descricao": "Aprofunda os conhecimentos em análise exploratória de dados, com foco em técnicas estatísticas e visuais para investigar padrões, anomalias e correlações. O conteúdo aborda o uso de distribuições, detecção de outliers, análise de correlação entre variáveis e construção de pivot tables para sintetizar grandes volumes de dados. Incentiva a documentação do processo de EDA por meio de notebooks interativos com interpretações escritas, promovendo um raciocínio investigativo e estruturado.",
          "projetos": [
            "EDA completa em dataset público",
            "Análise de outliers e tendências"
          ],
          "hard_skills": [
            "Execução de EDA com Python (pandas, seaborn, matplotlib)",
            "Construção de tabelas dinâmicas e pivot tables para análise de grandes volumes de dados",
            "Detecção de outliers, correlações e problemas de qualidade dos dados"
          ],
          "soft_skills": [
            "Curiosidade para investigar dados além do óbvio",
            "Pensamento crítico para interpretar padrões e anomalias",
            "Resolução de problemas a partir de hipóteses levantadas na análise"
          ],
          "ferramentas_principais": [
            "Python",
            "Power BI",
            "Google Colab",
            "Excel",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos": [
                {
                  "id": 3055,
                  "nome": "Data Visualization: criando gráficos com bibliotecas Python",
                  "link": "https://cursos.alura.com.br/course/data-visualization-graficos-bibliotecas-python"
                },
                {
                  "id": 3057,
                  "nome": "Data Visualization: gráficos de comparação e distribuição",
                  "link": "https://cursos.alura.com.br/course/data-visualization-graficos-comparacao-distribuicao"
                },
                {
                  "id": 3137,
                  "nome": "Data Visualization: gráficos de composição e relacionamento",
                  "link": "https://cursos.alura.com.br/course/data-visualization-graficos-composicao-relacionamento"
                },
                {
                  "id": 3056,
                  "nome": "Data Visualization: estilização de tabelas com Python",
                  "link": "https://cursos.alura.com.br/course/data-visualization-estilizacao-tabelas-python"
                }
              ]
            },
            {
              "stack": "Praticando gráficos",
              "cursos": [
                {
                  "id": 4420,
                  "nome": "Praticando gráficos: criando gráficos de comparação",
                  "link": "https://cursos.alura.com.br/course/python-criando-graficos-comparacao"
                },
                {
                  "id": 4475,
                  "nome": "Praticando gráficos: distribuição com Seaborn",
                  "link": "https://cursos.alura.com.br/course/python-criando-graficos-distribuicao",
                  "status": "ATIVO"
                },
                {
                  "id": 4421,
                  "nome": "Praticando gráficos: composição e relacionamento com Matplotlib e Plotly",
                  "link": "https://cursos.alura.com.br/course/python-graficos-composicao-relacionamento",
                  "status": "ATIVO"
                },
                {
                  "id": 4422,
                  "nome": "Praticando gráficos: criando gráficos customizados",
                  "link": "https://cursos.alura.com.br/course/python-criando-graficos-customizados"
                }
              ]
            }
          ]
        },
        {
          "nome": "Computação em Nuvem para Análise de Dados",
          "descricao": "Apresenta o uso prático de serviços de computação em nuvem aplicados à análise de dados. O foco está na utilização de ferramentas como Google BigQuery e Amazon S3 para armazenamento, consulta e processamento de grandes volumes de dados em ambientes cloud. O conteúdo aborda conceitos essenciais de escalabilidade, processamento distribuído e custo por uso, preparando o analista para atuar em ambientes modernos e conectados.",
          "projetos": [
            "Análise de dados com Google BigQuery",
            "Armazenamento de dados com Amazon S3"
          ],
          "hard_skills": [
            "Uso de serviços de nuvem para análise de dados (BigQuery, S3)",
            "Escrita de consultas SQL em ambientes cloud-based",
            "Noções de arquitetura e organização de dados em cloud storage"
          ],
          "soft_skills": [
            "Aprendizado contínuo em ambientes tecnológicos em evolução",
            "Proatividade na adoção de ferramentas modernas",
            "Capacidade de adaptação a diferentes plataformas e serviços"
          ],
          "ferramentas_principais": [
            "Google BigQuery",
            "Amazon S3",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Google BigQuery",
              "cursos": [
                {
                  "id": 3685,
                  "nome": "Google BigQuery: navegando na nuvem",
                  "link": "https://cursos.alura.com.br/course/google-big-query-navegando-nuvem",
                  "status": "CARREIRA"
                },
                {
                  "id": 3686,
                  "nome": "Google BigQuery: dominando Strings e Data",
                  "link": "https://cursos.alura.com.br/course/google-bigquery-dominando-strings-data",
                  "status": "CARREIRA"
                },
                {
                  "id": 3687,
                  "nome": "Google BigQuery: dominando funções lógicas e numéricas",
                  "link": "https://cursos.alura.com.br/course/google-bigquery-funcoes-logicas-numericas",
                  "status": "CARREIRA"
                },
                {
                  "id": 3688,
                  "nome": "Google BigQuery: manipulação de dados",
                  "link": "https://cursos.alura.com.br/course/google-bigquery-manipulacao-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 3728,
                  "nome": "Google Big Query: consultas avançadas",
                  "link": "https://cursos.alura.com.br/course/google-big-query-consultas-avancadas",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Business Intelligence com Goolge Looker Studio",
          "descricao": "Aprofunda o uso de ferramentas de BI e técnicas de visualização. Cobre a modelagem de dados dentro de ferramentas de BI (relacionamento entre tabelas, criação de modelos estrela simples para relatórios). Ensina a criar medidas e cálculos avançados (como métricas de comparação temporal: crescimento ano a ano, médias móveis) usando linguagens como DAX no Power BI ou cálculos equivalentes no Tableau. Explora visualizações avançadas (mapas geográficos, gráfico de dispersão com múltiplas medidas) e customização de dashboards para diferentes audiências. Também aborda práticas de publicação e atualização de dashboards online de forma profissional (configuração de atualização de dados, gerenciamento de acessos). Criação de dashboards interativos e narrativas visuais impactantes para tomada de decisão.",
          "projetos": [
            "Dashboard executivo para diretoria",
            "Storytelling de dados para resultados de negócio.",
            "Dashboard multidimensional de vendas",
            "Relatório geográfico e temporal interativo"
          ],
          "hard_skills": [
            "Modelagem de dados para BI (relacionamentos, modelo estrela)",
            "Criação de métricas avançadas em DAX ou linguagem equivalente",
            "Design e personalização de dashboards interativos",
            "Storytelling com dados aplicados a contextos executivos"
          ],
          "soft_skills": [
            "Visão de produto na construção de relatórios e painéis",
            "Comunicação eficaz com diferentes públicos (técnico e executivo)",
            "Capacidade de conectar insights de dados com objetivos de negócio"
          ],
          "ferramentas_principais": [
            "Tableau",
            "Power BI",
            "Python",
            "Plotly",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Looker Studio",
              "cursos": [
                {
                  "id": 2664,
                  "nome": "Looker Studio: criando o primeiro relatório",
                  "link": "https://cursos.alura.com.br/course/looker-studio-primeiro-relatorio",
                  "status": "CARREIRA"
                },
                {
                  "id": 2791,
                  "nome": "Looker Studio: visualização de dados",
                  "link": "https://cursos.alura.com.br/course/looker-studio-visualizacao-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 2921,
                  "nome": "Looker Studio: trabalhando com funções e filtros",
                  "link": "https://cursos.alura.com.br/course/looker-studio-funcoes-filtros",
                  "status": "CARREIRA"
                },
                {
                  "id": 3038,
                  "nome": "Looker Studio: parâmetros e combinações de dados",
                  "link": "https://cursos.alura.com.br/course/looker-studio-parametros-combinacoes-dados",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Técnicas de Previsão para Análise de Dados",
          "descricao": "Foca em conceitos estatísticos necessários para validar conclusões em análise de dados. Aborda distribuição de probabilidades (por exemplo, normal), conceitos de amostragem e margem de erro. Introduz testes de hipótese (t-test, qui-quadrado de forma prática) e interpretação de valor-p (p-value) e intervalos de confiança. Em seguida, introduz modelagem preditiva básica com ênfase em regressão linear simples e múltipla: como ajustar um modelo, interpretar coeficientes e avaliar a qualidade do modelo (R², erro médio). Também discute brevemente limitações e supostos dos modelos, enfatizando a importância de não confundir correlação com causalidade.",
          "projetos": [
            "Análise de distribuições em um dataset",
            "Aplicação de testes de hipótese",
            "Previsões com modelos de regressão linear"
          ],
          "hard_skills": [
            "Aplicação de testes estatísticos (significância, p-valor, intervalos de confiança)",
            "Construção e interpretação de modelos de regressão linear",
            "Uso de software estatístico ou bibliotecas para análise (Statsmodels/Scikit-learn em Python ou stats/R em R)"
          ],
          "soft_skills": [
            "Pensamento crítico",
            "Tomada de decisão baseada em dados"
          ],
          "ferramentas_principais": [
            "Python",
            "Excel",
            "Google Colab",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos": [
                {
                  "id": 1273,
                  "nome": "Estatística com Python: Correlação e Regressão",
                  "link": "https://cursos.alura.com.br/course/estatistica-correlacao-regressao",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "R",
              "cursos": [
                {
                  "id": 4197,
                  "nome": "Estatísticas com R: correlação e regressão",
                  "link": "https://cursos.alura.com.br/course/estatisticas-r-correlacao-regressao",
                  "status": "COMPLEMENTO"
                }
              ]
            }
          ]
        },
        {
          "nome": "Ferramentas SaaS - ERP",
          "descricao": "Apresenta o conceito de sistemas ERP (Enterprise Resource Planning) disponíveis como SaaS (Software as a Service) e sua relevância para análise de dados empresariais. Explora como integrar, extrair e analisar dados de sistemas ERP populares (como TOTVS, SAP, Oracle NetSuite, Omie, Bling) para apoiar decisões em áreas como vendas, finanças, estoque e RH. Aborda métodos de conexão (API, exportação, conectores nativos), tratamento de dados provenientes desses sistemas e boas práticas para criar análises e relatórios a partir de dados integrados de ERPs.",
          "projetos": [
            "Extração e Integração de Dados de um ERP SaaS",
            "Criação de Relatório Gerencial Integrando Dados do ERP"
          ],
          "hard_skills": [
            "Integração de dados de sistemas ERP SaaS via API ou exportação",
            "Tratamento e organização de grandes volumes de dados empresariais",
            "Criação de relatórios e dashboards integrando diferentes áreas de negócio"
          ],
          "soft_skills": [
            "Compreensão dos processos de negócio envolvidos em sistemas ERP",
            "Capacidade de traduzir demandas de negócio em análises e indicadores relevantes",
            "Atenção a questões de privacidade e governança dos dados empresariais"
          ],
          "ferramentas_principais": [
            "ERPs SaaS populares (TOTVS, SAP, Oracle NetSuite, Omie, Bling)",
            "Power BI, Excel ou Python para análise e visualização dos dados extraídos",
            "APIs, conectores nativos e ferramentas de integração de dados"
          ],
          "cursos": [
            {
              "stack": "SAP",
              "cursos": [
                {
                  "id": 0,
                  "nome": "SAP: Extração e Integração de Dados de um ERP SaaS",
                  "link": "https://cursos.alura.com.br/",
                  "status": "NOVIDADE"
                },
                {
                  "id": 0,
                  "nome": "SAP: Criação de Relatório Gerencial Integrando Dados do ERP",
                  "link": "https://cursos.alura.com.br/",
                  "status": "NOVIDADE"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "nivel": "Intermediário",
      "subnivel": "Nível III",
      "objetivos_gerais": [
        "Explorar bancos de dados NoSQL e análise de dados não estruturados.",
        "Automatizar processos de análise de dados e versionamento de projetos.",
        "Desenvolver projetos integrados de análise de dados em ambientes colaborativos."
      ],
      "blocos_tematicos": [
        {
          "nome": "Trabalhando com Microsoft SQL Server para Análise de Dados",
          "descricao": "Introduz o conceito de banco de dados relacional e linguagem SQL. Cobre criação de consultas simples: SELECT, filtros (WHERE), ordenação (ORDER BY), limites (LIMIT), e agregações básicas (GROUP BY com funções SUM, AVG, COUNT). Também apresenta conceitos de chave primária/estrangeira e, de forma introdutória, junção de tabelas (JOIN) para combinar dados de duas tabelas simples.",
          "projetos": [
            "Consultas simples em base de funcionários",
            "Relatórios simples com SQL em banco MySQL"
          ],
          "hard_skills": [
            "Consultas SQL básicas (SELECT, WHERE, ORDER BY, LIMIT)",
            "Uso de agregações com GROUP BY (SUM, COUNT, AVG)",
            "Compreensão de chaves primárias e estrangeiras",
            "Junção de tabelas simples com JOIN"
          ],
          "soft_skills": [
            "Pensamento crítico para formular consultas relevantes",
            "Autonomia na navegação e exploração de bancos relacionais",
            "Capacidade de transformar perguntas em instruções de extração de dados"
          ],
          "ferramentas_principais": [
            "Microsoft SQL Server",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Microsoft SQL Server 2022",
              "cursos": [
                {
                  "id": 3018,
                  "nome": "Microsoft SQL Server 2022: conhecendo SQL",
                  "link": "https://cursos.alura.com.br/course/microsoft-sql-server-conhecendo-sql",
                  "status": "CARREIRA"
                },
                {
                  "id": 2747,
                  "nome": "Microsoft SQL Server 2022: consultas avançadas",
                  "link": "https://cursos.alura.com.br/course/microsoft-sql-server-2022-consultas-avancadas",
                  "status": "CARREIRA"
                },
                {
                  "id": 2748,
                  "nome": "Microsoft SQL Server 2022: manipulando dados",
                  "link": "https://cursos.alura.com.br/course/microsoft-sql-server-2022-manipulando-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 2749,
                  "nome": "Microsoft SQL Server 2022: conhecendo o T-SQL",
                  "link": "https://cursos.alura.com.br/course/microsoft-sql-server-2022-conhecendo-t-sql",
                  "status": "CARREIRA"
                },
                {
                  "id": 2891,
                  "nome": "Microsoft SQL Server 2022: aprofundando em procedures e funções",
                  "link": "https://cursos.alura.com.br/course/microsoft-sql-server-2022-procedures-funcoes",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Avançando em Business Intelligence com Qlik Sense",
          "descricao": "Aprofunda o uso de ferramentas de BI e técnicas de visualização. Cobre a modelagem de dados dentro de ferramentas de BI (relacionamento entre tabelas, criação de modelos estrela simples para relatórios). Ensina a criar medidas e cálculos avançados (como métricas de comparação temporal: crescimento ano a ano, médias móveis) usando linguagens como DAX no Power BI ou cálculos equivalentes no Tableau. Explora visualizações avançadas (mapas geográficos, gráfico de dispersão com múltiplas medidas) e customização de dashboards para diferentes audiências. Também aborda práticas de publicação e atualização de dashboards online de forma profissional (configuração de atualização de dados, gerenciamento de acessos). Criação de dashboards interativos e narrativas visuais impactantes para tomada de decisão.",
          "projetos": [
            "Dashboard executivo para diretoria",
            "Storytelling de dados para resultados de negócio.",
            "Dashboard multidimensional de vendas",
            "Relatório geográfico e temporal interativo"
          ],
          "hard_skills": [
            "Modelagem de dados para BI (relacionamentos, modelo estrela)",
            "Criação de métricas avançadas em DAX ou linguagem equivalente",
            "Design e personalização de dashboards interativos",
            "Storytelling com dados aplicados a contextos executivos"
          ],
          "soft_skills": [
            "Visão de produto na construção de relatórios e painéis",
            "Comunicação eficaz com diferentes públicos (técnico e executivo)",
            "Capacidade de conectar insights de dados com objetivos de negócio"
          ],
          "ferramentas_principais": [
            "Tableau",
            "Power BI",
            "Python",
            "Plotly",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Qlik Sense",
              "cursos": [
                {
                  "id": 2363,
                  "nome": "Qlik Sense: conhecendo a ferramenta",
                  "link": "https://cursos.alura.com.br/course/qlik-sense-conhecendo-ferramenta",
                  "status": "CARREIRA"
                },
                {
                  "id": 2364,
                  "nome": "Qlik Sense: manipulando dados",
                  "link": "https://cursos.alura.com.br/course/qlik-sense-manipulando-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 2365,
                  "nome": "Qlik Sense: analisando dados",
                  "link": "https://cursos.alura.com.br/course/qlik-sense-analisando-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 2411,
                  "nome": "Qlik Sense: expressões avançadas",
                  "link": "https://cursos.alura.com.br/course/qlik-sense-expressoes-avancadas",
                  "status": "CARREIRA"
                },
                {
                  "id": 2412,
                  "nome": "Qlik Sense: conexões SQL",
                  "link": "https://cursos.alura.com.br/course/qlik-sense-conexoes-sql",
                  "status": "CARREIRA"
                },
                {
                  "id": 2413,
                  "nome": "Qlik Sense: histórias e gráficos",
                  "link": "https://cursos.alura.com.br/course/qlik-sense-historias-graficos",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Governança de Dados e Ética",
          "descricao": "Discute a importância de governança na gestão de dados corporativos e os aspectos éticos no uso de dados. Cobre princípios de qualidade de dados (acessibilidade, consistência, auditabilidade), segurança e controle de acesso. Aborda a Lei Geral de Proteção de Dados (LGPD) no contexto brasileiro (comparando com GDPR internacional quando relevante) e práticas para garantir conformidade (anonimização, consentimento). Explora questões éticas como viés algorítmico, uso adequado de dados sensíveis e transparência na comunicação de resultados. Inclui estudo de casos de problemas reais (vazamento de dados, decisões automatizadas injustas) para discutir consequências e melhores práticas.",
          "projetos": [
            "Política de Governança de Dados",
            "Análise de Caso Ético em Dados"
          ],
          "hard_skills": [
            "Conhecimento de legislações de proteção de dados (LGPD e conceitos do GDPR)",
            "Princípios de gestão e qualidade de dados (metadados, linhagem, controle de acesso)",
            "Avaliação de riscos e implementação de medidas de segurança de dados básicas"
          ],
          "soft_skills": [
            "Consciência ética e responsabilidade no uso de informações",
            "Pensamento crítico ao avaliar práticas de dados de uma organização",
            "Comunicação clara de políticas e diretrizes (escrita formal e objetividade)"
          ],
          "ferramentas_principais": [
            "Documentação de políticas (editores de texto, templates de governance)",
            "Ferramentas de qualidade de dados (conceptualmente, ex: perfis de dados, relatórios de qualidade)",
            "Leitura de casos/documentos legais (resumo da LGPD, diretrizes éticas de empresas de tecnologia)"
          ],
          "cursos": [
            {
              "stack": "Governança de Dados",
              "cursos": [
                {
                  "id": 3713,
                  "nome": "Governança de dados: explorando os conceitos fundamentais",
                  "link": "https://cursos.alura.com.br/course/governanca-dados-explorando-conceitos-fundamentais",
                  "status": "CARREIRA"
                },
                {
                  "id": 3714,
                  "nome": "Governança de dados: conhecendo o ciclo de vida dos dados",
                  "link": "https://cursos.alura.com.br/course/governanca-dados-conhecendo-ciclo-vida-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 3715,
                  "nome": "Governança de dados: garantindo a qualidade de dados com a biblioteca Pydeequ",
                  "link": "https://cursos.alura.com.br/course/governanca-dados-qualidade-dados-biblioteca-pydeequ",
                  "status": "CARREIRA"
                },
                {
                  "id": 3716,
                  "nome": "Governança de dados: usando metadados para compreender dados",
                  "link": "https://cursos.alura.com.br/course/governanca-dados-usando-metadados-compreender-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 3717,
                  "nome": "Governança de dados: mapeando a origem e o destino com linhagem de dados",
                  "link": "https://cursos.alura.com.br/course/governanca-dados-mapeando-origem-destino-linhagem-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 3718,
                  "nome": "Governança de dados: garantindo privacidade e proteção de dados para um futuro seguro",
                  "link": "https://cursos.alura.com.br/course/governanca-dados-garantindo-privacidade-protecao-dados-futuro-seguro",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Ferramentas de Automação de Tarefas",
          "descricao": "Aprimora as habilidades de programação em Python ou R com foco em eficiência, reutilização de código e automação de tarefas no contexto da análise de dados. O conteúdo abrange a escrita de funções personalizadas, uso de bibliotecas avançadas como NumPy para processamento vetorizado, consumo de APIs REST, e automação de tarefas como o processamento em lote de arquivos ou execução agendada de scripts. Também são apresentadas ferramentas modernas de automação para orquestrar fluxos de trabalho.",
          "projetos": [
            "Processamento em lote de arquivos",
            "Coleta automatizada de dados externos"
          ],
          "hard_skills": [
            "Programação intermediária em Python (funções, loops, automação)",
            "Consumo de APIs REST e integração com fontes externas",
            "Automação de tarefas analíticas e manipulação em lote de arquivos"
          ],
          "soft_skills": [
            "Pensamento sistêmico para automação de processos repetitivos",
            "Adaptabilidade frente a diferentes formatos e fontes de dados",
            "Organização no desenvolvimento e agendamento de rotinas automatizadas"
          ],
          "ferramentas_principais": [
            "Python",
            "REST APIs",
            "Make",
            "n8n",
            "Git",
            "GitHub Actions",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "n8n",
              "cursos": [
                {
                  "id": 0,
                  "nome": "n8n: Coleta automatizada de dados externos",
                  "link": "https://cursos.alura.com.br/",
                  "status": "NOVIDADE"
                }
              ]
            }
          ]
        },
        {
          "nome": "Ferramentas SaaS - CRM para Análise de Dados",
          "descricao": "Apresenta o conceito de sistemas CRM (Customer Relationship Management) no modelo SaaS (Software as a Service) e sua importância estratégica para análise de dados de relacionamento e vendas. Explora como integrar, extrair e analisar dados de CRMs populares (como Salesforce, HubSpot, Pipedrive, RD Station) para gerar indicadores de pipeline, funil de vendas, comportamento de clientes e desempenho comercial. Aborda métodos de conexão (API, exportação, conectores nativos), tratamento de dados e boas práticas para construção de relatórios e dashboards a partir de informações provenientes desses sistemas.",
          "projetos": [
            "Integração de Dados de um CRM SaaS",
            "Relatório de Indicadores Comerciais Integrando Dados do CRM"
          ],
          "hard_skills": [
            "Integração de dados de sistemas CRM SaaS via API ou exportação",
            "Tratamento de dados de relacionamento e vendas",
            "Criação de relatórios e dashboards de funil de vendas e performance comercial"
          ],
          "soft_skills": [
            "Compreensão do ciclo de relacionamento e vendas do cliente",
            "Capacidade de traduzir estratégias comerciais em indicadores mensuráveis",
            "Visão analítica para identificar oportunidades de otimização no processo comercial"
          ],
          "ferramentas_principais": [
            "CRMs SaaS populares (Salesforce, HubSpot, Pipedrive, RD Station)",
            "Power BI, Excel ou Python para análise e visualização dos dados extraídos",
            "APIs, conectores nativos e ferramentas de integração de dados para CRMs"
          ],
          "cursos": [
            {
              "stack": "Salesforce",
              "cursos": [
                {
                  "id": 0,
                  "nome": "Salesforce: Integração de Dados de um CRM SaaS",
                  "link": "https://cursos.alura.com.br/",
                  "status": "NOVIDADE"
                },
                {
                  "id": 0,
                  "nome": "Salesforce: Relatório de Indicadores Comerciais Integrando Dados do CRM",
                  "link": "https://cursos.alura.com.br/",
                  "status": "NOVIDADE"
                }
              ]
            }
          ]
        },
        {
          "nome": "Projeto Integrador (Nível Intermediário)",
          "descricao": "Projeto final deste nível que abrange um problema realista de análise de dados, exigindo aplicação de todas as habilidades desenvolvidas até aqui. O participante deverá, de forma autônoma, extrair e combinar dados de diferentes fontes, realizar análise exploratória aprofundada, aplicar métodos estatísticos para validar insights (e se pertinente, construir um modelo preditivo simples), e apresentar os resultados de maneira profissional.",
          "projetos": [
            "Análise Preditiva de Churn de Clientes",
            "Apresentação Profissional do Projeto",
            "Análise de dados de e-commerce integrando SQL, NoSQL e visualização em Power BI.",
            "Projeto de análise de dados de saúde pública com integração de APIs, Big Data e dashboards."
          ],
          "hard_skills": [
            "Orquestração de um projeto de análise completo (ETL, análise, modelagem, visualização)",
            "Aplicação de técnica preditiva em contexto de negócio (modelagem de churn, por exemplo)",
            "Documentação rigorosa e uso de ferramentas de colaboração (código em repositório, relatório final)",
            "Storytelling com dados"
          ],
          "soft_skills": [
            "Autonomia e gestão de tempo",
            "Comunicação eficaz",
            "Capacidade de conectar resultados de análise a recomendações práticas para a empresa"
          ],
          "ferramentas_principais": [
            "Python",
            "SQL",
            "NoSQL",
            "Power BI",
            "Excel",
            "AWS Glue",
            "Git"
          ]
        }
      ]
    },
    {
      "nivel": "Avançado",
      "subnivel": "Nível I",
      "objetivos_gerais": [
        "Desenvolver análises preditivas e prescritivas com machine learning básico.",
        "Utilizar ferramentas de AutoML e IA generativa para acelerar projetos.",
        "Aprofundar a integração de dados em ambientes complexos."
      ],
      "blocos_tematicos": [
        {
          "nome": "Big Data e Processamento Distribuído",
          "descricao": "Apresenta os fundamentos de Big Data e os principais conceitos de processamento distribuído, preparando o analista para lidar com grandes volumes de dados. Aborda o uso de frameworks como Apache Spark e Hadoop, destacando a importância da paralelização e da escalabilidade em ambientes com alto volume de dados. Também explora a aplicação de Spark por meio de PySpark em plataformas como Databricks, com integração a fontes como Amazon S3.",
          "projetos": [
            "Processamento de logs de acesso web com Spark.",
            "Análise de grandes datasets públicos usando Spark."
          ],
          "hard_skills": [
            "Fundamentos de Big Data e arquitetura de processamento distribuído",
            "Manipulação de grandes volumes de dados com PySpark",
            "Execução de transformações eficientes em ambientes escaláveis"
          ],
          "soft_skills": [
            "Aprendizado contínuo de tecnologias emergentes em dados",
            "Adaptabilidade a diferentes ambientes de execução e arquiteturas",
            "Raciocínio lógico para otimização de tarefas em larga escala"
          ],
          "ferramentas_principais": [
            "Databricks",
            "PySpark",
            "Apache Spark",
            "Amazon S3",
            "Ferramentas de IA"
          ],
          "cursos": [
            {
              "stack": "Spark",
              "cursos": [
                {
                  "id": 2273,
                  "nome": "Spark: apresentando a ferramenta",
                  "link": "https://cursos.alura.com.br/course/spark-apresentando-ferramenta",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "Databricks",
              "cursos": [
                {
                  "id": 2651,
                  "nome": "Databricks: conhecendo a ferramenta",
                  "link": "https://cursos.alura.com.br/course/databricks-conhecendo-ferramenta",
                  "status": "CARREIRA"
                },
                {
                  "id": 2652,
                  "nome": "Databricks: trabalhando com diversos formatos e tipos de arquivos",
                  "link": "https://cursos.alura.com.br/course/databricks-formatos-tipos-arquivos",
                  "status": "CARREIRA"
                },
                {
                  "id": 2657,
                  "nome": "Databricks: análise de dados",
                  "link": "https://cursos.alura.com.br/course/databricks-analise-dados",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Conhecimentos Básicos em Engenharia de Analytics",
          "descricao": "Apresenta os fundamentos essenciais da Engenharia de Analytics, conectando conceitos de engenharia de dados à rotina do analista. Aborda arquitetura de pipelines, camadas de dados (raw, silver, gold), versionamento, orquestração de processos, boas práticas de governança, e colaboração entre equipes técnicas e analíticas. O objetivo é preparar o analista para dialogar com engenheiros de dados, compreender o ciclo de vida dos dados e contribuir para projetos mais robustos, escaláveis e seguros.",
          "projetos": [
            {
              "nome": "Mapeamento do Pipeline Analítico em um Projeto Real ou Simulado",
              "descricao": "Desenhar e documentar um fluxo de dados completo desde a origem até o consumo, identificando etapas como extração, transformação, validação, armazenamento e análise. O projeto pode incluir a definição das camadas raw, silver e gold e o uso de ferramentas simples de orquestração ou scripts agendados."
            },
            {
              "nome": "Documentação e Versionamento de Dados Analíticos",
              "descricao": "Criar documentação técnica e um dicionário de dados para um projeto analítico, descrevendo tabelas, campos, transformações realizadas e regras de negócio aplicadas. Implementar versionamento básico de scripts ou pipelines utilizando Git."
            }
          ],
          "hard_skills": [
            "Compreensão de arquitetura de dados analíticos (pipelines, camadas, orquestração)",
            "Noções de governança, segurança e versionamento de dados",
            "Documentação técnica e dicionário de dados para projetos analíticos"
          ],
          "soft_skills": [
            "Colaboração multidisciplinar com engenheiros e cientistas de dados",
            "Organização e atenção a detalhes na estruturação de projetos",
            "Responsabilidade e visão de longo prazo para sustentabilidade dos dados"
          ],
          "ferramentas_principais": [
            "Plataformas de versionamento como Git",
            "Ferramentas de documentação e modelagem (Notion, Confluence, Lucidchart, dbdiagram.io)",
            "Orquestradores simples (Apache Airflow, scripts agendados, cron)",
            "Ferramentas cloud de armazenamento de dados (Amazon S3, BigQuery, Azure Data Lake)"
          ],
          "cursos": [
            {
              "stack": "AWS",
              "cursos": [
                {
                  "id": 4024,
                  "nome": "Engenharia de Analytics: implementando um pipeline ETL com AWS Glue",
                  "link": "https://cursos.alura.com.br/course/engenharia-analytics-pipeline-etl-aws-glue",
                  "status": "CARREIRA"
                },
                {
                  "id": 4014,
                  "nome": "Engenharia de Analytics: analisando dados com Amazon Athena e AWS Glue",
                  "link": "https://cursos.alura.com.br/course/engenharia-analytics-dados-amazon-athena-aws-glue",
                  "status": "CARREIRA"
                },
                {
                  "id": 4025,
                  "nome": "Engenharia de Analytics: construindo uma pipeline automatizada",
                  "link": "https://cursos.alura.com.br/course/engenharia-analytics-construindo-pipeline-automatizada",
                  "status": "CARREIRA"
                },
                {
                  "id": 4411,
                  "nome": "Amazon Quicksight: meu primeiro dashboard",
                  "link": "https://cursos.alura.com.br/course/amazon-quicksight-primeiro-dashboard",
                  "status": "CARREIRA"
                },
                {
                  "id": 4129,
                  "nome": "Engenharia de Analytics: apresentando resultados com QuickSight",
                  "link": "https://cursos.alura.com.br/course/engenharia-analytics-apresentando-resultados-quicksight",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Conceitos Básicos de Machine Learning",
          "descricao": "Entra no domínio de Data Science dentro do escopo do analista de dados. Cobre algoritmos de machine learning supervisionados e não supervisionados comuns em negócios: classificação (árvores de decisão, random forest, eventualmente gradient boosting), clusterização (k-means, hierárquico) e séries temporais (métodos de previsão como ARIMA ou modelos de smoothing). Foca na aplicação prática mais do que na teoria matemática profunda: como treinar modelos usando bibliotecas (scikit-learn em Python ou caret/tidymodels em R), validar modelos (separação treino/teste, cross-validation) e avaliar desempenho com métricas adequadas (acurácia, recall, RMSE, etc. dependendo do caso). Também discute brevemente AutoML e uso de ferramentas automatizadas, bem como considera ética e interpretabilidade de modelos (ex: importância de recursos, técnicas SHAP/LIME para explicar modelos complexos).",
          "projetos": [
            "Classificação de Risco de Crédito",
            "Clusterização de Perfis de Clientes"
          ],
          "hard_skills": [
            "Treinamento e validação de modelos de machine learning (classificação, clusterização, forecasting básico)",
            "Ajuste de hiperparâmetros e entendimento de métricas de avaliação de modelos",
            "Uso de bibliotecas avançadas de ML (scikit-learn, XGBoost, Prophet, caret, etc.) e interpretação de modelos"
          ],
          "soft_skills": [
            "Pensamento analítico avançado para definição de variáveis e validação de resultados de modelos",
            "Tomada de decisão baseada em dados (avaliar modelos e decidir implementação considerando impacto de negócio)",
            "Consciência ética na aplicação de modelos (avaliar viés e transparência nas previsões)"
          ],
          "ferramentas_principais": [
            "Python",
            "R",
            "Google Colab"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos": [
                {
                  "id": 3971,
                  "nome": "Machine Learning: classificação com SKLearn",
                  "link": "https://cursos.alura.com.br/course/machine-learning-classificacao-sklearn",
                  "status": "CARREIRA"
                },

                {
                  "id": 3677,
                  "nome": "Data Science: testando relações com Regressão Linear",
                  "link": "https://cursos.alura.com.br/course/data-science-testando-relacoes-regressao-linear",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "R",
              "cursos": [
                {
                  "id": 4198,
                  "nome": "Estatísticas com R: testando modelos de regressão",
                  "link": "https://cursos.alura.com.br/course/estatisticas-r-testando-modelos-regressao",
                  "status": "COMPLEMENTO"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "nivel": "Avançado",
      "subnivel": "Nível II",
      "objetivos_gerais": [
        "Desenvolver projetos de análise de dados ponta a ponta em ambientes empresariais.",
        "Aprofundar técnicas de storytelling e apresentação de resultados para alta gestão.",
        "Liderar equipes e atuar como referência técnica em projetos de dados."
      ],
      "blocos_tematicos": [
        {
          "nome": "Trabalhando com MongoDB em Análise de Dados",
          "descricao": "Apresenta o uso de dois bancos de dados NoSQL com maior aplicação no contexto de análise de dados: MongoDB, ideal para dados semi-estruturados em formato JSON, e Cassandra, recomendado para grandes volumes de dados distribuídos e consultas por chave de partição. O conteúdo ensina como acessar, consultar, tratar e exportar dados desses bancos para análises em ferramentas como Python ou SQL (no caso do Cassandra, via CQL). Aborda também boas práticas para lidar com esquemas flexíveis, alto volume de dados e performance em consultas analíticas.",
          "projetos": [
            "Análise de Dados de Usuários com MongoDB",
            "Exploração de Dados de Eventos em Cassandra"
          ],
          "hard_skills": [
            "Consultas e agregações em MongoDB usando pipelines (`aggregate`, `match`, `group`)",
            "Consultas em Cassandra com CQL (SELECT com filtros por chave de partição e clustering key)",
            "Manipulação e análise de dados semi-estruturados com Python"
          ],
          "soft_skills": [
            "Capacidade de adaptação a diferentes modelos de dados (documento e colunar)",
            "Precisão ao trabalhar com grandes volumes de dados distribuídos",
            "Organização na extração e validação de dados para uso analítico"
          ],
          "ferramentas_principais": [
            "Python",
            "MongoDB"
          ],
          "cursos": [
            {
              "stack": "MongoDB",
              "cursos": [
                {
                  "id": 2675,
                  "nome": "MongoDB: conhecendo um banco de dados NoSQL",
                  "link": "https://cursos.alura.com.br/course/mongodb-banco-dados-nosql",
                  "status": "CARREIRA"
                },
                {
                  "id": 2710,
                  "nome": "MongoDB: validando dados",
                  "link": "https://cursos.alura.com.br/course/mongodb-validando-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 2941,
                  "nome": "MongoDB: realizando consultas",
                  "link": "https://cursos.alura.com.br/course/mongodb-realizando-consultas",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "Python",
              "cursos": [
                {
                  "id": 3063,
                  "nome": "Pipeline de dados: integrando Python com MongoDB e MySQL",
                  "link": "https://cursos.alura.com.br/course/pipeline-dados-integrando-python-mongodb-mysql",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Liderança em Projetos de Dados e Estratégia Data-Driven",
          "descricao": "Prepara o profissional para papéis de referência e liderança. Discute como planejar e gerenciar projetos de análise de dados do início ao fim, incluindo definição de escopo, metodologias ágeis aplicadas a projetos de dados e acompanhamento de resultados. Aborda habilidades de liderança: mentorar membros juniores da equipe, facilitar a comunicação entre área técnica e stakeholders de negócio, e evangelizar a cultura orientada a dados dentro da empresa. Também trata da elaboração de estratégias data-driven: identificar oportunidades onde dados podem suportar decisões estratégicas, priorizar projetos de alto impacto e comunicar visão e roadmap de dados para a organização.",
          "projetos": [
            "Plano de Projeto Analítico",
            "Estratégia Data-Driven para Área de Negócio"
          ],
          "hard_skills": [
            "Gestão de projetos em contexto de dados (definição de escopo, cronograma, entregáveis de análise)",
            "Conhecimento de metodologias de trabalho (Agile/Scrum/Kanban) adaptadas para projetos de dados",
            "Definição de KPIs e construção de cases de uso de dados alinhados à estratégia empresarial"
          ],
          "soft_skills": [
            "Liderança e mentorship (orientar e desenvolver outros profissionais de dados)",
            "Comunicação interpessoal e influência (conseguir apoio para iniciativas de dados junto a executivos)",
            "Visão estratégica e de negócio, conectando soluções de dados a objetivos organizacionais"
          ],
          "ferramentas_principais": [
            "Ferramentas de gestão de projetos (Trello, Jira, Planner) para acompanhamento de tarefas",
            "Templates de documentação de projeto (canvas de projeto, planilhas de cronograma)",
            "Frameworks de estratégia (OKRs - Objectives and Key Results, por exemplo) para alinhar iniciativas de dados"
          ]
        },
        {
          "nome": "Storytelling com Dados e Comunicação para Alta Gestão",
          "descricao": "Desenvolve a capacidade do analista de dados de transformar análises complexas em narrativas claras, objetivas e alinhadas aos objetivos estratégicos da empresa. O foco está em comunicar resultados de forma impactante para públicos de alta gestão (C-level, diretoria), utilizando visualizações eficazes, contextualização de métricas e domínio de linguagem executiva. Aborda técnicas de storytelling com dados, seleção de indicadores-chave (KPIs) relevantes e adaptação do discurso para diferentes audiências.",
          "projetos": [
            "Apresentação Executiva de Análise de Desempenho",
            "Refinamento de Métricas e Relevância Estratégica"
          ],
          "hard_skills": [
            "Storytelling com dados (estrutura: contexto, problema, insight, ação)",
            "Construção de apresentações e dashboards executivos com foco em clareza e impacto",
            "Seleção e interpretação de indicadores estratégicos (KPIs e OKRs)"
          ],
          "soft_skills": [
            "Comunicação clara e objetiva com stakeholders não técnicos",
            "Capacidade de síntese e priorização de informações",
            "Postura de dono e protagonismo ao apresentar recomendações de negócio"
          ],
          "ferramentas_principais": [
            "Power BI",
            "Tableau",
            "Looker Studio",
            "Google Slides",
            "PowerPoint"
          ]
        },
        {
          "nome": "Tópicos Avançados e Tendências em Dados",
          "descricao": "Mantém o profissional atualizado com as evoluções rápidas do campo de análise de dados. Cobre tópicos emergentes que possam ser relevantes: por exemplo, análise de dados em mídias sociais, NLP (Processamento de Linguagem Natural) para extrair insights de dados de texto, análise de dados geoespaciais (GIS) aplicada a negócios locais, e o uso de Inteligência Artificial generativa (como ChatGPT) para auxiliar em tarefas de análise (desde geração de código até resumo de relatórios). Apresenta conceitos de Agentes de IA e ferramentas de BI aumentada, onde algoritmos automatizam parte da análise. Cada tópico é abordado em nível introdutório, dando ao aluno entendimento das possibilidades e ferramentas caso precise aplicá-las. Este bloco incentiva o aprendizado contínuo e a adaptabilidade às novas ferramentas e métodos que surgem no mercado global de dados.",
          "projetos": [
            "Mini-Projeto em NLP (Análise de Texto)",
            "Assistente de Análise com IA Generativa"
          ],
          "hard_skills": [
            "Noções de processamento de linguagem natural (NLP) e análise de sentimentos",
            "Conceitos de análise geoespacial e utilização de ferramentas especializadas (por exemplo, QGIS ou mapas em Python/R)",
            "Familiaridade com as novas tendências em inteligência artificial"
          ],
          "soft_skills": [
            "Aprendizado contínuo: capacidade de rapidamente aprender e testar novas tecnologias de dados",
            "Criatividade para aplicar novas técnicas em problemas reais de forma inovadora",
            "Senso crítico para avaliar resultados fornecidos por ferramentas automáticas ou IA"
          ],
          "ferramentas_principais": [
            "Python",
            "Bibliotecas de NLP (NLTK, spaCy ou equivalente em R) e APIs de análise de sentimento",
            "Ferramentas de mapas e geolocalização (Google Maps API, Folium)",
            "IA Generativa: ChatGPT, GitHub Copilot ou similares como assistentes",
            "Agentes de IA"
          ],
          "cursos": [
            {
              "stack": "Processamento de Linguagem Natural",
              "cursos": [
                {
                  "id": 3765,
                  "nome": "NLP: aplicando processamento de linguagem natural para análise de sentimentos",
                  "link": "https://cursos.alura.com.br/course/nlp-aplicando-processamento-linguagem-natural-analise-sentimentos",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "Georreferenciamento",
              "cursos": [
                {
                  "id": "3060",
                  "nome": "Geopandas: trabalhando com dados geoespaciais",
                  "link": "https://cursos.alura.com.br/course/geopandas-trabalhando-dados-geoespaciais",
                  "status": "CARREIRA"
                },
                {
                  "id": "3061",
                  "nome": "Dados geográficos: visualização de mapas com Folium",
                  "link": "https://cursos.alura.com.br/course/dados-geograficos-visualizacao-mapas-folium",
                  "status": "CARREIRA"
                }
              ]
            },
            {
              "stack": "Data Mesh",
              "cursos": [
                {
                  "id": 2499,
                  "nome": "Data Mesh: uma abordagem distribuída para dados",
                  "link": "https://cursos.alura.com.br/course/data-mesh-abordagem-distribuida-dados",
                  "status": "CARREIRA"
                },
                {
                  "id": 2500,
                  "nome": "Data Mesh: dados como produtos",
                  "link": "https://cursos.alura.com.br/course/data-mesh-dados-produtos",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "nivel": "Avançado",
      "subnivel": "Nível III",
      "objetivos_gerais": [
        "Atuar como especialista em análise de dados, liderando projetos estratégicos.",
        "Desenvolver soluções inovadoras com IA, automação e integração de dados em larga escala.",
        "Ser referência técnica e mentor para equipes multidisciplinares."
      ],
      "blocos_tematicos": [
        {
          "nome": "Projeto Final Integrador (Nível Avançado)",
          "descricao": "Trata-se de um desafio de dados completo e aberto, similar a um case real de mercado, que o aluno deve resolver integrando todas as habilidades desenvolvidas. Envolve definir o problema de forma autônoma, obter ou solicitar dados necessários, aplicar análises exploratórias, construir modelos preditivos ou prescritivos avançados se cabível, e entregar uma solução de alto impacto para o negócio. O projeto deve enfatizar rigor técnico (validação cruzada de modelos, documentação de código, uso de pipeline de dados se necessário) e também qualidade na apresentação do resultado final. Pode ser um problema personalizado para o próprio aluno (usando ferramenta de IA) para aproximar de seu contexto de interesse (por exemplo, otimização de cadeia logística, análise preditiva de vendas com múltiplos fatores, etc.).",
          "projetos": [
            "Case de Negócio de Análise Avançada"
          ],
          "hard_skills": [
            "Capacidade de conduzir um projeto de ciência de dados completo (incluindo aspectos de engenharia de dados, análise e modelagem)",
            "Integração de múltiplas tecnologias e ferramentas em uma solução coesa",
            "Preparação de documentação técnica e de negócio de alta qualidade para acompanhamento do projeto"
          ],
          "soft_skills": [
            "Excelência na comunicação",
            "Confiança profissional e postura proativa para atuar como especialista em dados",
            "Networking e apresentação pessoal (porfolio, perfil profissional) para inserção no mercado"
          ],
          "ferramentas_principais": [
            "Stack completa dominada pelo aluno (Python/R, SQL, BI, etc.) aplicada conforme a necessidade do projeto",
            "Ferramentas de colaboração e apresentação (GitHub, plataformas de blog ou web para portfólio, PowerPoint/Google Slides)"
          ]
        },
        {
          "nome": "Preparação para o Mercado",
          "descricao": "Este bloco final fornece orientação para a transição da formação para o mercado de trabalho. Engloba revisão dos principais pontos aprendidos, dicas para destacar projetos no portfólio e comunicar suas habilidades em processos seletivos. Orienta sobre possíveis certificações externas reconhecidas (como Microsoft Certified: Data Analyst Associate, etc.), participação na comunidade de dados (meetups, Kaggle, blogs) e aprendizagem contínua. Também cobre preparação para entrevistas técnicas e comportamentais, com simulação de perguntas comuns para analistas de dados seniores. O objetivo é garantir que, ao concluir a trilha, o profissional esteja confiante e bem posicionado para buscar oportunidades na área de dados, tanto no mercado brasileiro quanto, se desejado, internacionalmente.",
          "projetos": [
            "Portfolio Data Professional",
            "Simulação de Entrevista e Plano de Desenvolvimento"
          ],
          "hard_skills": [
            "Síntese de habilidades e projetos em forma de portfólio atraente",
            "Conhecimento de certificações e qualificações adicionais relevantes no mercado",
            "Habilidade de explicar conceitos técnicos complexos de forma acessível durante entrevistas"
          ],
          "soft_skills": [
            "Marketing pessoal e storytelling de carreira (como contar sua trajetória e conquistas)",
            "Preparação para entrevistas (comunicação clara, controle emocional, ética profissional)",
            "Planejamento de carreira e autoavaliação contínua"
          ],
          "ferramentas_principais": [
            "Plataformas de portfólio (GitHub Pages, Medium, LinkedIn, Kaggle profiles) para divulgação de trabalhos",
            "Recursos de treinamento em entrevistas (ex: bancos de perguntas, mock interviews online)",
            "Comunidades profissionais (Meetup, fóruns, grupos) para networking e atualização"
          ]
        },
        {
          "nome": "Atuação Independente em Análise de Dados: Empreendedorismo e Consultoria",
          "descricao": "Desenvolve competências para que analistas de dados atuem como profissionais independentes, seja como consultores especializados ou empreendedores de produtos e serviços baseados em dados. O conteúdo cobre desde o diagnóstico de clientes até o desenvolvimento de soluções próprias, precificação, marketing e relacionamento com stakeholders. Ideal para quem deseja empreender ou prestar serviços como freelancer ou consultor.",
          "projetos": [
            "Plano de Consultoria para uma Empresa com Baixa Maturidade Analítica",
            "Criação de um Produto Analítico com Validação de Mercado"
          ],
          "hard_skills": [
            "Diagnóstico de maturidade analítica e definição de KPIs",
            "Criação de produtos ou serviços baseados em dados",
            "Estruturação de propostas de valor e precificação"
          ],
          "soft_skills": [
            "Mentalidade empreendedora e visão de negócio",
            "Comunicação consultiva e foco em entregas com valor real",
            "Autonomia, organização e gestão do relacionamento com clientes"
          ],
          "ferramentas_principais": [
            "Power BI, Python, Excel como plataformas de entrega de valor",
            "Templates de proposta e briefing (Notion, Docs, Miro)",
            "Ferramentas de comunicação e automação (Slack, Trello, Zapier, Stripe)"
          ]
        }
      ]
    }
  ],
  "cursos_fora_da_trilha": [
                {
                  "id": 3293,
                  "nome": "Introdução à SQL",
                  "link": "https://cursos.alura.com.br/course/introducao-sql",
                  "status": "ATIVO"
                },
                {
                  "id": 3585,
                  "nome": "Excel Para Além das Fórmulas",
                  "link": "https://cursos.alura.com.br/course/excel-alem-formulas",
                  "status": "ATIVO"
                },
                {
                  "id": 3206,
                  "nome": "Como coletar e manipular dados corretamente",
                  "link": "https://cursos.alura.com.br/course/modulo-5-coletar-manipular-dados-corretamente",
                  "status": "ATIVO"
                },
                {
                  "id": 1008,
                  "nome": "Excel: simulação e análise de cenários",
                  "link": "https://cursos.alura.com.br/course/excel-simulacao-e-analise-de-cenarios",
                  "status": "ATIVO"
                },
                {
                  "id": 1225,
                  "nome": "Análise de dados: cálculos, padrões e estratégias com Excel",
                  "link": "https://cursos.alura.com.br/course/analise-de-dados-excel",
                  "status": "ATIVO"
                },
                {
                  "id": 3719,
                  "nome": "Excel aplicado ao mercado financeiro: construindo dashboards e realizando consultas",
                  "link": "https://cursos.alura.com.br/course/excel-aplicado-mercado-financeiro-dashboards-realizando-consultas",
                  "status": "ATIVO"
                },
                {
                  "id": 4002,
                  "nome": "Análise financeira eficiente: automatize o Excel com Power Query e Power Pivot",
                  "link": "https://cursos.alura.com.br/course/analise-financeira-eficiente-automatize-excel-power-query-power-pivot",
                  "status": "ATIVO"
                },
                {
                  "id": 4247,
                  "nome": "Excel para RH: construindo seu primeiro relatório",
                  "link": "https://cursos.alura.com.br/course/excel-rh-construindo-primeiro-relatorio",
                  "status": "ATIVO"
                },
                {
                  "id": 4248,
                  "nome": "Excel avançado para RH: funções, análises e dashboards estratégicos",
                  "link": "https://cursos.alura.com.br/course/excel-avancado-rh-funcoes-analises-dashboards-estrategicos",
                  "status": "ATIVO"
                },
                {
                  "id": 4249,
                  "nome": "Excel estratégico para RH: automação, macros e planejamento avançado",
                  "link": "https://cursos.alura.com.br/course/excel-estrategico-rh-automacao-macros-planejamento-avancado",
                  "status": "ATIVO"
                },
                {
                  "id": 2092,
                  "nome": "Excel VBA: criando Formulários para facilitar a entrada de dados nas planilhas",
                  "link": "https://cursos.alura.com.br/course/excel-vba-formularios-facilitar-entrada-dados-planilhas",
                  "status": "ATIVO"
                },
                {
                  "id": 2093,
                  "nome": "Excel VBA 3: criando conexão com o Outlook Application",
                  "link": "https://cursos.alura.com.br/course/excel-vba-conexao-outlook-application",
                  "status": "ATIVO"
                },
                {
                  "id": 2120,
                  "nome": "Excel VBA 4: criando conexão com Access",
                  "link": "https://cursos.alura.com.br/course/excel-vba-4-criando-conexao-access",
                  "status": "ATIVO"
                },
                {
                  "id": 1109,
                  "nome": "Data Science: analise e visualização de dados",
                  "link": "https://cursos.alura.com.br/course/data-science-primeiros-passos",
                  "status": "ATIVO"
                },
                {
                  "id": 2924,
                  "nome": "NumPy: análise numérica eficiente com Python",
                  "link": "https://cursos.alura.com.br/course/numpy-analise-numerica-eficiente-pythons",
                  "status": "ATIVO"
                },
                {
                  "id": 807,
                  "nome": "Report Analysis com Power BI: gerando relatórios empresariais",
                  "link": "https://cursos.alura.com.br/course/business-intelligence-power-bi",
                  "status": "ATIVO"
                },
                {
                  "id": 3540,
                  "nome": "Power BI: análises avançadas",
                  "link": "https://cursos.alura.com.br/course/power-bi-analises-avancadas",
                  "status": "ATIVO"
                },
                {
                  "id": 3262,
                  "nome": "Dashboards e Power BI: usando modelos OLAP multidimensionais",
                  "link": "https://cursos.alura.com.br/course/dashboards-power-bi-modelos-olap-multidimensionais",
                  "status": "ATIVO"
                },
                {
                  "id": 1703,
                  "nome": "Data Science: análises para saúde e medicina",
                  "link": "https://cursos.alura.com.br/course/data-science-saude-e-medicina",
                  "status": "ATIVO"
                },
                {
                  "id": 3048,
                  "nome": "SQL com MySQL: manipule e consulte dados",
                  "link": "https://cursos.alura.com.br/course/sql-mysql-manipule-dados-com-sql",
                  "status": "ATIVO"
                },
                {
                  "id": 1222,
                  "nome": "Comandos DML: manipulação de dados com MySQL",
                  "link": "https://cursos.alura.com.br/course/mysql-dml-manipulacao-de-dados",
                  "status": "ATIVO"
                },
                {
                  "id": 3779,
                  "nome": "MySQL Administrator: configurando e monitorando o servidor",
                  "link": "https://cursos.alura.com.br/course/mysql-administrator-configurando-monitorando-servidor",
                  "status": "ATIVO"
                },
                {
                  "id": 3813,
                  "nome": "MySQL Administrator: criando índices e manipulando dados",
                  "link": "https://cursos.alura.com.br/course/mysql-administrator-criando-indices-manipulando-dados",
                  "status": "ATIVO"
                },
                {
                  "id": 3814,
                  "nome": "MySQL Administrator: gerenciando esquemas e usuários",
                  "link": "https://cursos.alura.com.br/course/mysql-administrator-gerenciando-esquemas-usuarios",
                  "status": "ATIVO"
                },
                {
                  "id": 3815,
                  "nome": "MySQL Administrator: backups e replicação de banco de dados",
                  "link": "https://cursos.alura.com.br/course/mysql-administrator-backups-replicacao-banco-dados",
                  "status": "ATIVO"
                },
                {
                  "id": 3370,
                  "nome": "Identificando vieses e armadilhas em análises",
                  "link": "https://cursos.alura.com.br/course/identificando-vieses-armadilhas-analises",
                  "status": "ATIVO"
                },
                {
                  "id": 2389,
                  "nome": "Oracle ADS: análise de dados na nuvem",
                  "link": "https://cursos.alura.com.br/course/oracle-ads-analise-dados-nuvem",
                  "status": "ATIVO"
                },
                {
                  "id": 1119,
                  "nome": "Data Science: análise de series temporais",
                  "link": "https://cursos.alura.com.br/course/data-science-series-temporais",
                  "status": "ATIVO"
                },
                {
                  "id": 860,
                  "nome": "Regressão linear: testando relações e prevendo resultados",
                  "link": "https://cursos.alura.com.br/course/data-science-modelo-regressao-linear",
                  "status": "ATIVO"
                },
                {
                  "id": 1118,
                  "nome": "Regressão Linear: técnicas avançadas de modelagem",
                  "link": "https://cursos.alura.com.br/course/data-science-modelo-regressao-linear-assimetria-statsmodel",
                  "status": "ATIVO"
                },
                {
                  "id": 3193,
                  "nome": "Aprofundando em Métricas",
                  "link": "https://cursos.alura.com.br/course/modulo-1-aprofundando-metricas",
                  "status": "ATIVO"
                },
                {
                  "id": 3194,
                  "nome": "Métricas no dia a dia de Produto",
                  "link": "https://cursos.alura.com.br/course/modulo-2-metricas-dia-dia-produto",
                  "status": "ATIVO"
                },
                {
                  "id": 3201,
                  "nome": "Visualização de dados e alinhamento com stakeholders",
                  "link": "https://cursos.alura.com.br/course/modulo-3-visualizacao-dados-alinhamento-stakeholders",
                  "status": "ATIVO"
                },
                {
                  "id": 4402,
                  "nome": "Polars: analisando dados de forma eficiente",
                  "link": "https://cursos.alura.com.br/course/polars-analisando-dados-forma-eficiente",
                  "status": "ATIVO"
                },
                {
                  "id": 4403,
                  "nome": "Polars: manipulando tabelas",
                  "link": "https://cursos.alura.com.br/course/polars-manipulando-tabelas",
                  "status": "ATIVO"
                },
                {
                  "id": 4406,
                  "nome": "Polars: explorando polars com Rust",
                  "link": "https://cursos.alura.com.br/course/polars-explorando-polars-rust",
                  "status": "ATIVO"
                },
                {
                  "id": 3016,
                  "nome": "Data Mart e Analysis Services: construindo um modelo OLAP multidimensional",
                  "link": "https://cursos.alura.com.br/course/data-mart-analysis-services-modelo-olap-multidimensional",
                  "status": "ATIVO"
                },
                {
                  "id": 3261,
                  "nome": "Data Mart e Analysis Services: trabalhando com KPIs",
                  "link": "https://cursos.alura.com.br/course/data-mart-analysis-services-trabalhando-kpis",
                  "status": "ATIVO"
                },
                {
                  "id": 2568,
                  "nome": "MicroStrategy Workstation: transformações e métricas",
                  "link": "https://cursos.alura.com.br/course/microstrategy-workstation-transformacoes-metricas",
                  "status": "ATIVO"
                },
                {
                  "id": 1447,
                  "nome": "Data Visualization: criação de gráficos com o Matplotlib",
                  "link": "https://cursos.alura.com.br/course/customizacao-matplot"
                },
                {
                  "id": 2655,
                  "nome": "Databricks e Data Factory: criando e orquestrando pipelines na nuvem",
                  "link": "https://cursos.alura.com.br/course/databricks-data-factory-pipelines-nuvem",
                  "status": "ATIVO"
                },
                {
                  "id": 2656,
                  "nome": "Databricks: construindo pipelines de dados com Airflow e Azure Databricks",
                  "link": "https://cursos.alura.com.br/course/databricks-pipelines-dados-airflow-azure-databricks",
                  "status": "ATIVO"
                },
                {
                  "id": 2689,
                  "nome": "Apache Airflow: transformação de dados com Spark",
                  "link": "https://cursos.alura.com.br/course/apache-airflow-transformacao-dados-spark",
                  "status": "ATIVO"
                },
                {
                  "id": 3012,
                  "nome": "Data Lake e Integration Services: construindo e carregando as dimensões",
                  "link": "https://cursos.alura.com.br/course/data-lake-integration-services-construindo-carregando-dimensoes",
                  "status": "ATIVO"
                },
                {
                  "id": 3013,
                  "nome": "Data Lake e Integration Services: construindo e carregando o tempo e as fatos",
                  "link": "https://cursos.alura.com.br/course/data-lake-integration-services-construindo-carregando-tempo-fatos",
                  "status": "ATIVO"
                },
                {
                  "id": 3014,
                  "nome": "Data Warehouse e Integration Services: carregando dados dimensionais",
                  "link": "https://cursos.alura.com.br/course/data-warehouse-integration-services-dados-dimensionais",
                  "status": "ATIVO"
                },
                {
                  "id": 3015,
                  "nome": "Data Warehouse e Integration Services: carregando fatos e dimensão tempo",
                  "link": "https://cursos.alura.com.br/course/data-warehouse-integration-services-carregando-fatos-dimensao-tempo",
                  "status": "ATIVO"
                },
                {
                  "id": 1313,
                  "nome": "Data Analytics: Machine Learning com Google Cloud Platform",
                  "link": "https://cursos.alura.com.br/course/data-analytics-google-cloud",
                  "status": "ATIVO"
                },
                {
                  "id": 2115,
                  "nome": "Acesso ao Big Query: manipulação programático linguagens",
                  "link": "https://cursos.alura.com.br/course/big-query-manipulacao-programatico-linguagens",
                  "status": "ATIVO"
                },
                {
                  "id": 3447,
                  "nome": "AWS Data Lake: criando uma pipeline para ingestão de dados",
                  "link": "https://cursos.alura.com.br/course/aws-data-lake-criando-pipeline-ingestao-dados",
                  "status": "ATIVO"
                },
                {
                  "id": 3448,
                  "nome": "AWS Data Lake: processando dados com AWS Glue",
                  "link": "https://cursos.alura.com.br/course/aws-data-lake-dados-aws-glue",
                  "status": "ATIVO"
                },
                {
                  "id": 3449,
                  "nome": "AWS Data Lake: processando dados com AWS EMR",
                  "link": "https://cursos.alura.com.br/course/aws-data-lake-processando-dados-aws-emr",
                  "status": "ATIVO"
                },
                {
                  "id": 4407,
                  "nome": "Amazon Redshift: ingestão de dados",
                  "link": "https://cursos.alura.com.br/course/amazon-redshift-ingestao-dados",
                  "status": "ATIVO"
                },
                {
                  "id": 1815,
                  "nome": "Engenharia de Dados: organizando dados na AWS",
                  "link": "https://cursos.alura.com.br/course/engenharia-dados-organizando-dados-aws",
                  "status": "ATIVO"
                },
                {
                  "id": 2464,
                  "nome": "Azure Data Lake: criando um pipeline de ingestão de dados",
                  "link": "https://cursos.alura.com.br/course/azure-data-lake-pipeline-ingestao-dados",
                  "status": "ATIVO"
                },
                {
                  "id": 3450,
                  "nome": "AWS Data Lake: análise de dados com Athena e Quicksight",
                  "link": "https://cursos.alura.com.br/course/aws-data-lake-analise-dados-athena-quicksight",
                  "status": "ATIVO"
                },
                {
                  "id": 3010,
                  "nome": "Modelagem do Data Warehouse: atributos, hierarquia e indicadores",
                  "link": "https://cursos.alura.com.br/course/modelagem-data-warehouse-atributos-hierarquia-indicadores",
                  "status": "ATIVO"
                },
                {
                  "id": 3011,
                  "nome": "SQL Server: construção do Data Warehouse",
                  "link": "https://cursos.alura.com.br/course/sql-server-construcao-data-warehouse",
                  "status": "ATIVO"
                },
                {
                  "id": 1954,
                  "nome": "Apache Beam: Data Pipeline com Python",
                  "link": "https://cursos.alura.com.br/course/apache-beam-data-pipeline-python",
                  "status": "ATIVO"
                },
                {
                  "id": 2463,
                  "nome": "Aprofundando no Airflow: Executor Kubernetes",
                  "link": "https://cursos.alura.com.br/course/aprofundando-airflow-executor-kubernetes",
                  "status": "ATIVO"
                },
                {
                  "id": 3766,
                  "nome": "Data Science: transformando variáveis para uma Regressão Linear",
                  "link": "https://cursos.alura.com.br/course/data-science-transformando-variaveis-regressao-linear",
                  "status": "ATIVO"
                },
                {
                  "id": 2665,
                  "nome": "Apache Airflow: orquestrando seu primeiro pipeline de dados",
                  "link": "https://cursos.alura.com.br/course/apache-airflow-primeiro-pipeline-dados",
                  "status": "ATIVO"
                },
                {
                  "id": 2688,
                  "nome": "Apache Airflow: extração de dados",
                  "link": "https://cursos.alura.com.br/course/apache-airflow-extracao-dados",
                  "status": "ATIVO"
                },
                {
                  "id": 1576,
                  "nome": "MLOps: Machine Learning e APIs",
                  "link": "https://cursos.alura.com.br/course/mlops-machine-learning-e-apis",
                  "status": "ATIVO"
                },
                {
                  "id": 1814,
                  "nome": "MLOps: deploy de modelos",
                  "link": "https://cursos.alura.com.br/course/mlops-deploy-modelos",
                  "status": "ATIVO"
                },
                {
                  "id": 2945,
                  "nome": "CD4ML: Entrega Contínua para Machine Learning",
                  "link": "https://cursos.alura.com.br/course/cd4ml-entrega-continua-machine-learning",
                  "status": "ATIVO"
                },
                {
                  "id": 2958,
                  "nome": "Continuous Delivery for Machine Learning: completando o Pipeline",
                  "link": "https://cursos.alura.com.br/course/continuous-delivery-machine-learning-pipeline-completo",
                  "status": "ATIVO"
                },
                {
                  "id": 2104,
                  "nome": "MLflow: gestão do ciclo de vidas de modelos de ML",
                  "link": "https://cursos.alura.com.br/course/mlflow-gestao-ciclo-vidas-modelos-ml",
                  "status": "ATIVO"
                },
                {
                  "id": 3694,
                  "nome": "Dash: construindo dashboards para modelos de Machine Learning",
                  "link": "https://cursos.alura.com.br/course/dash-dashboards-modelos-machine-learning",
                  "status": "ATIVO"
                },
                {
                  "id": 1057,
                  "nome": "Machine Learning: validação de modelos",
                  "link": "https://cursos.alura.com.br/course/machine-learning-validando-modelos",
                  "status": "ATIVO"
                },
                {
                  "id": 1080,
                  "nome": "Machine Learning parte 1: otimização de modelos através de hiperparâmetros",
                  "link": "https://cursos.alura.com.br/course/machine-learning-otimizacao-de-modelos-atraves-de-hiperparametros",
                  "status": "ATIVO"
                },
                {
                  "id": 1103,
                  "nome": "Machine Learning parte 2: otimização com exploração aleatória",
                  "link": "https://cursos.alura.com.br/course/machine-learning-otimizacao-com-exploracao-aleatoria",
                  "status": "ATIVO"
                },
                {
                  "id": 1128,
                  "nome": "Machine Learning: intro a sistemas de recomendação em Python",
                  "link": "https://cursos.alura.com.br/course/introducao-a-sistemas-de-recomendacao-com-python",
                  "status": "ATIVO"
                },
                {
                  "id": 1160,
                  "nome": "Data Analytics: Machine Learning no Marketing Digital",
                  "link": "https://cursos.alura.com.br/course/machine-learning-marketing-digital",
                  "status": "ATIVO"
                },
                {
                  "id": 1210,
                  "nome": "Machine Learning: lidando com dados de muitas dimensões",
                  "link": "https://cursos.alura.com.br/course/reducao-dimensionalidade",
                  "status": "ATIVO"
                },
                {
                  "id": 2570,
                  "nome": "Regressão com Sklearn: desenvolvimento, previsão e otimização",
                  "link": "https://cursos.alura.com.br/course/regressao-sklearn-desenvolvimento-previsao-otimizacao",
                  "status": "ATIVO"
                },
                {
                  "id": 2604,
                  "nome": "Clustering aplicado: recomendando músicas com K-Means",
                  "link": "https://cursos.alura.com.br/course/clustering-aplicado-recomendando-musicas-k-means",
                  "status": "ATIVO"
                },
                {
                  "id": 2605,
                  "nome": "Análise de componentes principais: elaboração de rankings com o PCA",
                  "link": "https://cursos.alura.com.br/course/analise-componentes-elaboracao-rankings-pca",
                  "status": "ATIVO"
                },
                {
                  "id": 2654,
                  "nome": "Databricks: criando um sistema de recomendação",
                  "link": "https://cursos.alura.com.br/course/databricks-criando-sistema-recomendacao",
                  "status": "ATIVO"
                },
                {
                  "id": 3064,
                  "nome": "Classificação: construindo modelos semi-supervisionados",
                  "link": "https://cursos.alura.com.br/course/classificacao-construindo-modelos-semi-supervisionados",
                  "status": "ATIVO"
                },
                {
                  "id": 3067,
                  "nome": "Classificação: aprendendo a classificar dados com Machine Learning",
                  "link": "https://cursos.alura.com.br/course/classificacao-aprendendo-classificar-dados-machine-learning",
                  "status": "ATIVO"
                },
                {
                  "id": 3068,
                  "nome": "Classificação: resolvendo problemas multiclasse",
                  "link": "https://cursos.alura.com.br/course/classificacao-resolvendo-problemas-multiclasse",
                  "status": "ATIVO"
                },
                {
                  "id": 3069,
                  "nome": "Classificação: validação de modelos e métricas de avaliação",
                  "link": "https://cursos.alura.com.br/course/classificacao-validacao-modelos-metricas-avaliacao",
                  "status": "ATIVO"
                },
                {
                  "id": 3070,
                  "nome": "Classificação: otimizando modelos de machine learning",
                  "link": "https://cursos.alura.com.br/course/classificacao-otimizando-modelos-machine-learning",
                  "status": "ATIVO"
                },
                {
                  "id": 3071,
                  "nome": "Classificação: selecionando features",
                  "link": "https://cursos.alura.com.br/course/classificacao-selecionando-features",
                  "status": "ATIVO"
                },
                {
                  "id": 3072,
                  "nome": "Classificação: melhorando o desempenho com XGBoost",
                  "link": "https://cursos.alura.com.br/course/classificacao-melhorando-desempenho-xgboost",
                  "status": "ATIVO"
                },
                {
                  "id": 1364,
                  "nome": "Análise e Classificação de Faces: visão Computacional com OpenCV",
                  "link": "https://cursos.alura.com.br/course/analise-classificacao-faces-visao-computacional-opencv",
                  "status": "ATIVO"
                },
                {
                  "id": 1382,
                  "nome": "Classificação multilabel de textos: múltiplos contextos em NLP",
                  "link": "https://cursos.alura.com.br/course/classificacao-multilabel-nlp",
                  "status": "ATIVO"
                },
                {
                  "id": 1384,
                  "nome": "Clustering: extraindo padrões de dados",
                  "link": "https://cursos.alura.com.br/course/cluster-analysis",
                  "status": "ATIVO"
                },
                {
                  "id": 1414,
                  "nome": "Redes Neurais: Deep Learning com PyTorch",
                  "link": "https://cursos.alura.com.br/course/pln-deep-learning",
                  "status": "ATIVO"
                },
                {
                  "id": 1431,
                  "nome": "Reconhecimento de imagens: Twitter e Computer Vision API",
                  "link": "https://cursos.alura.com.br/course/reconhecimento-imagens",
                  "status": "ATIVO"
                },
                {
                  "id": 1563,
                  "nome": "Treinando uma Rede Neural: Deep Learning com PyTorch",
                  "link": "https://cursos.alura.com.br/course/treinando-rede-neural-pytorch",
                  "status": "ATIVO"
                },
                {
                  "id": 3140,
                  "nome": "Pesquisa operacional: entendendo as bases dos métodos de otimização",
                  "link": "https://cursos.alura.com.br/course/pesquisa-operacional-bases-metodos-otimizacao",
                  "status": "ATIVO"
                },
                {
                  "id": 3202,
                  "nome": "Experimentações e ferramentas de teste",
                  "link": "https://cursos.alura.com.br/course/modulo-4-experimentacoes-ferramentas-teste",
                  "status": "ATIVO"
                },
                {
                  "id": 3264,
                  "nome": "Classificação: combinando classificadores para a melhoria de performance",
                  "link": "https://cursos.alura.com.br/course/classificacao-combinando-classificadores-melhoria-performance",
                  "status": "ATIVO"
                },
                {
                  "id": 3369,
                  "nome": "Experimentação com Teste a/b",
                  "link": "https://cursos.alura.com.br/course/experimentacao-teste-a-b",
                  "status": "ATIVO"
                },
                {
                  "id": 3415,
                  "nome": "IA aumentada: prevendo atrasos de voos",
                  "link": "https://cursos.alura.com.br/course/ia-aumentada-prevendo-atrasos-voos",
                  "status": "ATIVO"
                },
                {
                  "id": 3436,
                  "nome": "Otimização: implementando a programação linear",
                  "link": "https://cursos.alura.com.br/course/otimizacao-implementando-programacao-linear",
                  "status": "ATIVO"
                },
                {
                  "id": 3437,
                  "nome": "Otimização: encontrando soluções inteiras em programação linear",
                  "link": "https://cursos.alura.com.br/course/otimizacao-solucoes-inteiras-programacao-linear",
                  "status": "ATIVO"
                },
                {
                  "id": 3438,
                  "nome": "Otimização: aplicando programação não linear",
                  "link": "https://cursos.alura.com.br/course/otimizacao-programacao-nao-linear",
                  "status": "ATIVO"
                },
                {
                  "id": 3439,
                  "nome": "Otimização: aplicando a programação por restrições",
                  "link": "https://cursos.alura.com.br/course/otimizacao-aplicando-programacao-restricoes",
                  "status": "ATIVO"
                },
                {
                  "id": 3458,
                  "nome": "IA aumentada: entendendo e praticando otimização com OR-Tools",
                  "link": "https://cursos.alura.com.br/course/ia-aumentada-entendendo-praticando-otimizacao-or-tools",
                  "status": "ATIVO"
                },
                {
                  "id": 3678,
                  "nome": "Data Science: analisando e prevendo séries temporais",
                  "link": "https://cursos.alura.com.br/course/data-science-analisando-prevendo-series-temporais",
                  "status": "ATIVO"
                },
                {
                  "id": 3764,
                  "nome": "Clusterização: lidando com dados sem rótulo",
                  "link": "https://cursos.alura.com.br/course/clusterizacao-lidando-dados-sem-rotulo",
                  "status": "ATIVO"
                },
                {
                  "id": 3767,
                  "nome": "Regressão: construindo Árvores de Regressão",
                  "link": "https://cursos.alura.com.br/course/regressao-construindo-arvores-regressao",
                  "status": "ATIVO"
                },
                {
                  "id": 3768,
                  "nome": "Regressão: aprimorando os resultados com XGBoost",
                  "link": "https://cursos.alura.com.br/course/regressao-aprimorando-resultados-xgboost",
                  "status": "ATIVO"
                },
                {
                  "id": 3769,
                  "nome": "Séries temporais: detectando anomalias e realizando previsões",
                  "link": "https://cursos.alura.com.br/course/series-temporais-detectando-anomalias-realizando-previsoes",
                  "status": "ATIVO"
                },
                {
                  "id": 3770,
                  "nome": "Regressão: prevendo séries temporais com Prophet",
                  "link": "https://cursos.alura.com.br/course/regressao-prevendo-series-temporais-prophet",
                  "status": "ATIVO"
                },
                {
                  "id": 3771,
                  "nome": "Regressão: realizando previsão de séries temporais com statsmodels",
                  "link": "https://cursos.alura.com.br/course/regressao-realizando-previsao-series-temporais-statsmodels",
                  "status": "ATIVO"
                },
                {
                  "id": 4149,
                  "nome": "Big Query ML: trabalhando com modelos de classificação",
                  "link": "https://cursos.alura.com.br/course/big-query-ml-trabalhando-modelos-classificacao",
                  "status": "ATIVO"
                },
                {
                  "id": 982,
                  "nome": "Deep Learning parte 1: Keras",
                  "link": "https://cursos.alura.com.br/course/deep-learning-introducao-com-keras",
                  "status": "ATIVO"
                },
                {
                  "id": 1667,
                  "nome": "Clusterização de dados: segmentação de clientes",
                  "link": "https://cursos.alura.com.br/course/clusterizacao-dados-segmentacao-clientes",
                  "status": "ATIVO"
                },
                {
                  "id": 1734,
                  "nome": "Redes Neurais Convolucionais: Deep Learning com PyTorch",
                  "link": "https://cursos.alura.com.br/course/cnn-redes-neurais-convolucionais-deep-learning-pytorch",
                  "status": "ATIVO"
                },
                {
                  "id": 1799,
                  "nome": "Árvores de Decisão: aprofundando em modelos de Machine Learning",
                  "link": "https://cursos.alura.com.br/course/arvores-decisao-aprofundando-modelos-machine-learning",
                  "status": "ATIVO"
                },
                {
                  "id": 1810,
                  "nome": "Deep Learning: previsão com Keras",
                  "link": "https://cursos.alura.com.br/course/deep-learning-previsao-keras",
                  "status": "ATIVO"
                },
                {
                  "id": 1892,
                  "nome": "Redes Neurais Recorrentes: Deep Learning com Pytorch",
                  "link": "https://cursos.alura.com.br/course/rnn-redes-neurais-recorrentes-deep-learning-pytorch",
                  "status": "ATIVO"
                },
                {
                  "id": 2124,
                  "nome": "Machine Learning: Credit Scoring",
                  "link": "https://cursos.alura.com.br/course/machine-learning-credit-scoring",
                  "status": "ATIVO"
                },
                {
                  "id": 2182,
                  "nome": "Aprendizado não supervisionado: primeiras técnicas e métodos",
                  "link": "https://cursos.alura.com.br/course/aprendizado-nao-supervisionado-tecnicas-metodos",
                  "status": "ATIVO"
                },
                {
                  "id": 2276,
                  "nome": "Spark: criando modelos de classificação",
                  "link": "https://cursos.alura.com.br/course/spark-modelos-classificacao",
                  "status": "ATIVO"
                },
                {
                  "id": 2277,
                  "nome": "Spark: trabalhando com regressão",
                  "link": "https://cursos.alura.com.br/course/spark-trabalhando-regressao",
                  "status": "ATIVO"
                },
                {
                  "id": 2278,
                  "nome": "Spark: sistema de recomendação",
                  "link": "https://cursos.alura.com.br/course/spark-sistema-recomendacao",
                  "status": "ATIVO"
                },
                {
                  "id": 2398,
                  "nome": "Machine Learning com Oracle ADS: produtividade na criação de modelos",
                  "link": "https://cursos.alura.com.br/course/machine-learning-oracle-ads-criacao-modelos",
                  "status": "ATIVO"
                },
                {
                  "id": 2422,
                  "nome": "Machine Learning: classificação por trás dos panos",
                  "link": "https://cursos.alura.com.br/course/machine-learning-classificacao-tras-panos",
                  "status": "ATIVO"
                },
                {
                  "id": 2423,
                  "nome": "Modelos preditivos em dados: detecção de fraude",
                  "link": "https://cursos.alura.com.br/course/modelos-preditivos-dados-deteccao-fraude",
                  "status": "ATIVO"
                },
                {
                  "id": 2790,
                  "nome": "MongoDB: modelagem de dados",
                  "link": "https://cursos.alura.com.br/course/mongodb-modelagem-de-dados",
                  "status": "ATIVO"
                },
                {
                  "id": 2942,
                  "nome": "MongoDB: segurança e disponibilidade dos dados",
                  "link": "https://cursos.alura.com.br/course/mongodb-seguranca-disponibilidade-dados",
                  "status": "ATIVO"
                },
                {
                  "id": 2943,
                  "nome": "MongoDB: trabalhando com armazenamento, backups e otimização de consulta",
                  "link": "https://cursos.alura.com.br/course/mongodb-armazenamento-backups-otimizacao-consulta",
                  "status": "ATIVO"
                },
                {
                  "id": 1321,
                  "nome": "NLP: regex e modelos de linguagem",
                  "link": "https://cursos.alura.com.br/course/nlp-modelos-linguagem",
                  "status": "ATIVO"
                },
                {
                  "id": 1581,
                  "nome": "Corretor Ortográfico em Python: aplicando técnicas de NLP",
                  "link": "https://cursos.alura.com.br/course/nlp-corretor-ortografico",
                  "status": "ATIVO"
                },
                {
                  "id": 1638,
                  "nome": "Word2Vec: interpretação da linguagem humana com Word embedding",
                  "link": "https://cursos.alura.com.br/course/introducao-word-embedding",
                  "status": "ATIVO"
                },
                {
                  "id": 1745,
                  "nome": "Word2Vec: treinamento de Word Embedding",
                  "link": "https://cursos.alura.com.br/course/word2vec-treinamento-word-embedding",
                  "status": "ATIVO"
                },
                {
                  "id": 3972,
                  "nome": "NLP: buscando entidades em documentos",
                  "link": "https://cursos.alura.com.br/course/nlp-buscando-entidades-documentos",
                  "status": "ATIVO"
                },
                {
                  "id": 3973,
                  "nome": "NLP: trabalhando com similaridade de sentenças",
                  "link": "https://cursos.alura.com.br/course/nlp-trabalhando-similaridade-sentencas",
                  "status": "ATIVO"
                },
                {
                  "id": 3974,
                  "nome": "NLP: explorando LLM para aplicações de chatbot",
                  "link": "https://cursos.alura.com.br/course/nlp-explorando-llm-aplicacoes-chatbot",
                  "status": "ATIVO"
                },
    {
      "id": "1037",
      "nome": "Deep Learning parte 2: como a rede aprende",
      "link": "https://cursos.alura.com.br/course/deep-learning-como-a-rede-aprende"
    },
    {
      "id": "1224",
      "nome": "Administração do MySQL: segurança e otimização do banco",
      "link": "https://cursos.alura.com.br/course/mysql-dba-administracao"
    },
    {
      "id": "2662",
      "nome": "Keras: primeiros passos em redes neurais",
      "link": "https://cursos.alura.com.br/course/keras-primeiros-passos-redes-neurais"
    },
    {
      "id": "2663",
      "nome": "Visão Computacional: reconhecimento de texto com OCR e OpenCV",
      "link": "https://cursos.alura.com.br/course/visao-computacional-reconhecimento-texto-ocr-opencv"
    },
    {
      "id": "2666",
      "nome": "Visão computacional: detecção de texto em placas de carro",
      "link": "https://cursos.alura.com.br/course/visao-computacional-deteccao-texto-placas-carro"
    },
    {
      "id": "2733",
      "nome": "Visão Computacional: detecção de movimento com OpenCV",
      "link": "https://cursos.alura.com.br/course/visao-computacional-deteccao-movimento-opencv"
    },
    {
      "id": "2737",
      "nome": "Visão computacional: Hand Tracking com OpenCV",
      "link": "https://cursos.alura.com.br/course/visao-computacional-hand-tracking-opencv"
    },
    {
      "id": "2783",
      "nome": "Visão Computacional: análise facial",
      "link": "https://cursos.alura.com.br/course/visao-computacional-analise-facial"
    },
    {
      "id": "2828",
      "nome": "Data Mesh: gerenciando controle e dependências",
      "link": "https://cursos.alura.com.br/course/data-mesh-controle-dependencias"
    },
    {
      "id": "2829",
      "nome": "Data Mesh: infraestrutura e planos",
      "link": "https://cursos.alura.com.br/course/data-mesh-infraestrutura-planos"
    },
    {
      "id": "1456",
      "nome": "Datomic: um banco cronológico",
      "link": "https://cursos.alura.com.br/course/introducao-ao-datomic"
    },
    {
      "id": "1457",
      "nome": "Datomic Queries: avançando com o modelo e pesquisas",
      "link": "https://cursos.alura.com.br/course/datomic-identidade-e-queries"
    },
    {
      "id": "1458",
      "nome": "Datomic: Schemas e Regras",
      "link": "https://cursos.alura.com.br/course/datomic-schemas-regras"
    },
    {
      "id": "1459",
      "nome": "Datomic: Bindings, transaction functions e filters",
      "link": "https://cursos.alura.com.br/course/datomic-bindings-transaction-functions-e-filters"
    },
    {
      "id": "1460",
      "nome": "Datomic: banco filtrado e histórico",
      "link": "https://cursos.alura.com.br/course/datomic-banco-filtrado-e-historico"
    },
    {
      "id": "1490",
      "nome": "Datomic: geradores, schemas e índices",
      "link": "https://cursos.alura.com.br/course/datomic-geradores-schemas-e-indices"
    },
    {
      "id": "3459",
      "nome": "IA aumentada: aprimorando técnicas de otimização em um problema prático",
      "link": "https://cursos.alura.com.br/course/ia-aumentada-tecnicas-otimizacao-problema-pratico"
    },
    {
      "id": "3574",
      "nome": "Data Mart e Analysis Services: entendendo a linguagem de consultas MDX",
      "link": "https://cursos.alura.com.br/course/data-mart-analysis-services-linguagem-consultas-mdx"
    },
    {
      "id": "3581",
      "nome": "IA aumentada: adicionando a dimensão de tempo ao problema de voos",
      "link": "https://cursos.alura.com.br/course/ia-aumentada-dimensao-tempo-problema-voos"
    },
    {
      "id": "3582",
      "nome": "Power Apps: descobrindo o poder da automação LowCode",
      "link": "https://cursos.alura.com.br/course/power-apps-descobrindo-poder-automacao-lowcode"
    },
    {
      "id": "3633",
      "nome": "TensorFlow: implementando um perceptron de múltiplas camadas (MLP)",
      "link": "https://cursos.alura.com.br/course/tensorflow-implementando-perceptron-multiplas-camadas"
    },
    {
      "id": "4322",
      "nome": "Entrevista com especialista de mercado: CFO da Ericsson",
      "link": "https://cursos.alura.com.br/course/entrevista-especialista-mercado-cfo-ericsson"
    },
    {
      "id": "4442",
      "nome": "REDIS: Sistema de Gerenciamento de Tarefas",
      "link": "https://cursos.alura.com.br/course/redis-sistema-gerenciamento-tarefas"
    },
    {
      "id": "4443",
      "nome": "Redis manipulação de dados: Strings, Listas e Conjuntos",
      "link": "https://cursos.alura.com.br/course/redis-manipulacao-dados-strings-listas-conjuntos"
    },
    {
      "id": "4444",
      "nome": "Redis estruturas de dados avançadas: Hashes, Sorted Sets e HyperLogLog",
      "link": "https://cursos.alura.com.br/course/redis-estruturas-dados-avancadas-hashes-sorted-sets-hyperloglog"
    },
    {
      "id": "4448",
      "nome": "Power Apps: criando aplicativos personalizados para negócios e automação de processos de RH",
      "link": "https://cursos.alura.com.br/course/power-apps-criando-aplicativos-personalizados-negocios-automacao-processos-rh"
    }
  ]
}